(self.webpackChunktradingview = self.webpackChunktradingview || []).push([
    [178],
    {
        12978: (e) => {
            e.exports = "داده‌های لحظه‌ای برای {symbolName}";
        },
        64565: (e) => {
            e.exports = "توسط صرافی {exchange} ارائه شده است.";
        },
        19801: (e) => {
            e.exports = "جمعه";
        },
        11268: (e) => {
            e.exports = "دوشنبه";
        },
        63331: (e) => {
            e.exports = "شنبه";
        },
        85954: (e) => {
            e.exports = "یکشنبه";
        },
        26230: (e) => {
            e.exports = "چهارشنبه";
        },
        24793: (e) => {
            e.exports = "پنج‌شنبه";
        },
        31533: (e) => {
            e.exports = "سه‌شنبه";
        },
        89790: (e) => {
            e.exports = "کد منبع Pine را نمی‌توان دریافت کرد.";
        },
        39589: (e) => {
            e.exports = "فشرده کردن پنل";
        },
        38154: (e) => {
            e.exports = "تایید حذف درخت مطالعات";
        },
        53205: (e) => {
            e.exports = "قراردادهای آتی پیوسته";
        },
        15993: (e) => {
            e.exports = "قراردادهای آتی پیوسته ابزارهای ترکیبی مصنوعی هستند که از ترکیب قراردادهای منفرد تشکیل می‌شوند. قرارداد 1! نمایانگر ماه پیش‌رو (نزدیک‌ترین تاریخ انقضا) است، در حالی که 2! نمایانگر دومین تاریخ انقضا نزدیک است.";
        },
        45e3: (e) => {
            e.exports = "Cboe One";
        },
        56934: (e) => {
            e.exports = "تغییر توضیحات";
        },
        23398: (e) => {
            e.exports = ["تغییر نماد"];
        },
        36004: (e) => {
            e.exports = "ایجاد یک حساب کاربری رایگان";
        },
        69419: (e) => {
            e.exports = "همه چیز خوب است — بازار باز است.";
        },
        97637: (e) => {
            e.exports = ["فروردین"];
        },
        86797: (e) => {
            e.exports = ["مرداد"];
        },
        22519: (e) => {
            e.exports = ["مقادیر تغییر میله"];
        },
        41707: (e) => {
            e.exports = "خرید داده‌های لحظه‌ای";
        },
        52003: (e) => {
            e.exports = "آیا واقعاً می‌خواهید مطالعه و تمام زیرمجموعه‌های آن را حذف کنید؟";
        },
        68854: (e) => {
            e.exports = "دابل کلیک";
        },
        97325: (e) => {
            e.exports = "خطای داده";
        },
        52916: (e) => {
            e.exports = "داده‌ها یک بار در روز به‌روز می‌شوند.";
        },
        25978: (e) => {
            e.exports = "داده‌ها یک بار در ثانیه به‌روز می‌شوند، حتی اگر بازار بیشتر به‌روز شود.";
        },
        57310: (e) => {
            e.exports = "داده‌ها با تأخیر هستند";
        },
        49321: (e) => {
            e.exports = "داده‌ها در طرح اولیه ما یک بار در ثانیه به‌روز می‌شوند، حتی اگر بازار بیشتر به‌روز شود.";
        },
        55669: (e) => {
            e.exports = ["آذر"];
        },
        83498: (e) => {
            e.exports = "حذف پنل";
        },
        6044: (e) => {
            e.exports = "داده‌های مشتق شده";
        },
        31461: (e) => {
            e.exports = "داده‌های مشتق شده به شاخص‌های مالی اشاره دارد که با ترکیب و/یا پردازش داده‌های خام تامین شده از منابع مختلف ایجاد می‌شوند.";
        },
        59315: (e) => {
            e.exports = "داده‌های پایان روز";
        },
        82751: (e) => {
            e.exports = ["خطا"];
        },
        40519: (e) => {
            e.exports = "عصر. بازار برای معاملات پس از بازار باز است.";
        },
        80227: (e) => {
            e.exports = "منطقه زمانی صرافی";
        },
        16467: (e) => {
            e.exports = "بهمن";
        },
        25046: (e) => {
            e.exports = "پر کردن توافقنامه‌های صرافی";
        },
        93666: (e) => {
            e.exports = "نماد پرچم";
        },
        564: (e) => {
            e.exports = "جمعه";
        },
        72970: (e) => {
            e.exports = "جمعه";
        },
        88958: (e) => {
            e.exports = "تعطیلات";
        },
        32960: (e) => {
            e.exports = "نماد حلال";
        },
        21686: (e) => {
            e.exports = "مخفی کردن افسانه اندیکاتور";
        },
        26935: (e) => {
            e.exports = ["آرگومان‌های اندیکاتور"];
        },
        26315: (e) => {
            e.exports = ["عنوان اندیکاتور"];
        },
        84098: (e) => {
            e.exports = ["مقادیر اندیکاتور"];
        },
        91459: (e) => {
            e.exports = "اگر داده‌های لحظه‌ای {listedExchange} را می‌خواهید، باید یک توافقنامه صرافی را تکمیل کنید. نگران نباشید، فقط چند کلیک طول می‌کشد";
        },
        50634: (e) => {
            e.exports = "در {remainingTime} به معاملات پس از بازار خواهد رفت.";
        },
        74537: (e) => {
            e.exports = "در {remainingTime} برای معاملات پیش از بازار باز خواهد شد.";
        },
        26910: (e) => {
            e.exports = "ژانویه";
        },
        23230: (e) => {
            e.exports = "جولای";
        },
        49385: (e) => {
            e.exports = "خرداد";
        },
        99487: (e) => {
            e.exports = ["مقادیر OHLC"];
        },
        15815: (e) => {
            e.exports = "یک به‌روزرسانی در هر ثانیه";
        },
        90784: (e) => {
            e.exports = "مهر";
        },
        75991: (e) => {
            e.exports = "وضعیت بازار باز";
        },
        37274: (e) => {
            e.exports = "مقادیر تغییر روز آخر";
        },
        36051: (e) => {
            e.exports = "بیشتر بدانید";
        },
        39899: (e) => {
            e.exports = "انتقال پنل به پایین";
        },
        70343: (e) => {
            e.exports = "انتقال پنل به بالا";
        },
        83085: (e) => {
            e.exports = "دوشنبه";
        },
        61199: (e) => {
            e.exports = "دوشنبه";
        },
        41610: (e) => {
            e.exports = ["بیشتر"];
        },
        1653: (e) => {
            e.exports = "صبح. بازار برای معاملات پیش از بازار باز است.";
        },
        56470: (e) => {
            e.exports = "بزرگنمایی نمودار";
        },
        19603: (e) => {
            e.exports = "بزرگنمایی پنل";
        },
        68327: (e) => {
            e.exports = ["می"];
        },
        35732: (e) => {
            e.exports = "مدیریت پنل‌ها";
        },
        84675: (e) => {
            e.exports = "اسفند";
        },
        83949: (e) => {
            e.exports = "بازار باز است";
        },
        35701: (e) => {
            e.exports = "بازار در {remainingTime} باز می‌شود.";
        },
        95814: (e) => {
            e.exports = "بازار بسته است";
        },
        98105: (e) => {
            e.exports = "بازار در {remainingTime} بسته می‌شود.";
        },
        56086: (e) => {
            e.exports = "بازار در حال حاضر در تعطیلات است. خوش به حالشان.";
        },
        71194: (e) => {
            e.exports = "آبان";
        },
        66324: (e) => {
            e.exports = "کد منبع";
        },
        36835: (e) => {
            e.exports = "شنبه";
        },
        1144: (e) => {
            e.exports = "شنبه";
        },
        40653: (e) => {
            e.exports = "پیمایش به چپ";
        },
        26721: (e) => {
            e.exports = "پیمایش به جدیدترین میله";
        },
        35809: (e) => {
            e.exports = "پیمایش به راست";
        },
        61132: (e) => {
            e.exports = "شهریور";
        },
        28705: (e) => {
            e.exports = "نمایش افسانه اندیکاتور";
        },
        51072: (e) => {
            e.exports = "نمایش درخت اشیاء";
        },
        37809: (e) => {
            e.exports = "نمایش تنظیمات بازه";
        },
        39045: (e) => {
            e.exports = "خطای مطالعه";
        },
        86577: (e) => {
            e.exports = "یکشنبه";
        },
        72149: (e) => {
            e.exports = "یکشنبه";
        },
        46041: (e) => {
            e.exports = "منبع قیمت نماد";
        },
        63143: (e) => {
            e.exports = "عنوان نماد";
        },
        29985: (e) => {
            e.exports = "پس از بازار";
        },
        28412: (e) => {
            e.exports = "برنامه‌های پولی دارای به‌روزرسانی داده‌های سریع‌تر هستند.";
        },
        56042: (e) => {
            e.exports = "پیش از بازار";
        },
        24680: (e) => {
            e.exports = "فهرست اولیه";
        },
        89022: (e) => {
            e.exports = "داده‌های لحظه‌ای برای این نماد در حال حاضر پشتیبانی نمی‌شود. ممکن است در آینده پشتیبانی شود.";
        },
        6667: (e) => {
            e.exports = "داده‌های لحظه‌ای برای {symbolName} توسط صرافی {exchange} ارائه می‌شود.";
        },
        48293: (e) => {
            e.exports = "بازیابی نمودار";
        },
        91029: (e) => {
            e.exports = "بازیابی پنل";
        },
        75094: (e) => {
            e.exports = "چهارشنبه";
        },
        7147: (e) => {
            e.exports = "چهارشنبه";
        },
        52984: (e) => {
            e.exports = "برای دریافت داده‌های لحظه‌ای برای {description}، لطفاً بسته داده‌های لحظه‌ای را خریداری کنید.";
        },
        9787: (e) => {
            e.exports = "پنج‌شنبه";
        },
        7951: (e) => {
            e.exports = "پنج‌شنبه";
        },
        99214: (e) => {
            e.exports = "بورس اصلی یا اولین بازار سهامی که سهام یک شرکت در آن فهرست شده و معامله می‌شود.";
        },
        2310: (e) => {
            e.exports = "این داده‌ها لحظه‌ای هستند، اما ممکن است کمی با همتای رسمی خود که از صرافی‌های اولیه می‌آید متفاوت باشند.";
        },
        29512: (e) => {
            e.exports = "این داده‌ها لحظه‌ای هستند، اما ممکن است کمی با همتای رسمی خود که از {exchange} می‌آید متفاوت باشند.";
        },
        52449: (e) => {
            e.exports = "این یک سهام مطابق با شریعت است، به این معنی که از قوانین اسلامی پیروی می‌کند. این شرکت بهره نمی‌گیرد یا دریافت نمی‌کند و در برخی بخش‌ها (قمار، الکل، تنباکو، محصولات خوک) فعالیت نمی‌کند.";
        },
        86753: (e) => {
            e.exports = "این داده‌های لحظه‌ای توسط صرافی {originalExchange} ارائه می‌شود. ممکن است کمی با داده‌های رسمی که مستقیماً از {exchange} می‌آید متفاوت باشد. اگر این تفاوت برای شما مهم است، باید داده‌های لحظه‌ای را از صرافی اولیه خریداری کنید که ما می‌توانیم در این زمینه کمک کنیم.";
        },
        73717: (e) => {
            e.exports = "این نماد وجود ندارد، لطفاً یکی دیگر را انتخاب کنید.";
        },
        57048: (e) => {
            e.exports = "وقت پیاده‌روی است — این بازار بسته است.";
        },
        94316: (e) => {
            e.exports = "سه‌شنبه";
        },
        44979: (e) => {
            e.exports = "سه‌شنبه";
        },
        8209: (e) => {
            e.exports = "حذف پرچم نماد";
        },
        1111: (e) => {
            e.exports = ["حجم"];
        },
        61311: (e) => {
            e.exports = ["بزرگ نمایی"];
        },
        47602: (e) => {
            e.exports = ["کوچک نمایی"];
        },
        57889: (e) => {
            e.exports = "تغییر قابل مشاهده بودن مقادیر OHLC";
        },
        18644: (e) => {
            e.exports = "تغییر قابل مشاهده بودن وضعیت بازار باز";
        },
        45110: (e) => {
            e.exports = "تغییر قابل مشاهده بودن تغییر میله";
        },
        31325: (e) => {
            e.exports = "تغییر قابل مشاهده بودن عناوین اندیکاتور";
        },
        99774: (e) => {
            e.exports = "تغییر قابل مشاهده بودن مقادیر اندیکاتور";
        },
        96162: (e) => {
            e.exports = "تغییر قابل مشاهده بودن آرگومان‌های اندیکاتور";
        },
        50058: (e) => {
            e.exports = "تغییر قابل مشاهده بودن تغییر روز آخر";
        },
        26717: (e) => {
            e.exports = "تغییر قابل مشاهده بودن توضیحات نماد";
        },
        6091: (e) => {
            e.exports = "تغییر قابل مشاهده بودن فیلد نماد";
        },
        9455: (e) => {
            e.exports = "تغییر قابل مشاهده بودن مقادیر حجم";
        },
        39348: (e) => {
            e.exports = "کمتر از 1 دقیقه";
        },
        87358: (e) => {
            e.exports = "نمایش {title}";
        },
        7827: (e) => {
            e.exports = "{days} و {hours}";
        },
        7435: (e) => {
            e.exports = "{exchange} توسط {originalExchange}";
        },
        19830: (e) => {
            e.exports = "{hours} و {دقیقه}";
        },
        1084: (e) => {
            e.exports = "داده‌های لحظه‌ای {listedExchange} برای کاربران ثبت شده رایگان است.";
        },
        38611: (e) => {
            e.exports = "داده‌های {symbolName} به دلیل الزامات صرافی {time} دقیقه تأخیر دارند.";
        },
        77033: (e) => {
            e.exports = ["داده‌ها هر {amount} ثانیه یک بار به‌روز می‌شوند، حتی اگر به‌روزرسانی‌های بیشتری در بازار وجود داشته باشد."];
        },
        2121: (e) => {
            e.exports = ["داده‌ها در طرح اولیه ما هر {amount} ثانیه یک بار به‌روز می‌شوند، حتی اگر به‌روزرسانی‌های بیشتری در بازار وجود داشته باشد."];
        },
        5223: (e) => {
            e.exports = ["یک به‌روزرسانی هر {amount} ثانیه"];
        },
        58609: (e) => {
            e.exports = ["{number} روز"];
        },
        24430: (e) => {
            e.exports = ["{number} ساعت"];
        },
        67151: (e) => {
            e.exports = ["{number} دقیقه"];
        },
    },
]);
