(self.webpackChunktradingview = self.webpackChunktradingview || []).push([
    [2547],
    {
        50831: (e) => {
            e.exports = "میله‌ها";
        },
        19648: (e) => {
            e.exports = "12-ساعته";
        },
        55838: (e) => {
            e.exports = "24-ساعته";
        },
        23238: (e) => {
            e.exports = "بوم نقاشی";
        },
        72171: (e) => {
            e.exports = "مرکز";
        },
        88364: (e) => {
            e.exports = "سبک‌های پایه نمودار";
        },
        46720: (e) => {
            e.exports = ["نشانه‌گر"];
        },
        50985: (e) => {
            e.exports = "ارز";
        },
        17319: (e) => {
            e.exports = "ارز و واحد";
        },
        68791: (e) => {
            e.exports = "آرگومان‌ها";
        },
        95036: (e) => {
            e.exports = "میانگین قیمت بسته";
        },
        91757: (e) => {
            e.exports = ["پایین"];
        },
        27331: (e) => {
            e.exports = ["پس‌زمینه"];
        },
        22519: (e) => {
            e.exports = ["مقادیر تغییر میله"];
        },
        87845: (e) => {
            e.exports = "دکمه‌ها";
        },
        39392: (e) => {
            e.exports = "خطوط شبکه";
        },
        25209: (e) => {
            e.exports = ["فرمت تاریخ"];
        },
        55090: (e) => {
            e.exports = "روز هفته روی برچسب‌ها";
        },
        29601: (e) => {
            e.exports = ["شرح"];
        },
        26897: (e) => {
            e.exports = ["وقایع"];
        },
        77405: (e) => {
            e.exports = "افقی";
        },
        34403: (e) => {
            e.exports = "فقط افقی";
        },
        60971: (e) => {
            e.exports = "بالاترین و پایین‌ترین قیمت";
        },
        61142: (e) => {
            e.exports = ["اندیکاتورها"];
        },
        34905: (e) => {
            e.exports = "مقدار اندیکاتورها";
        },
        29687: (e) => {
            e.exports = "مقدار اندیکاتورها و مالیات";
        },
        25084: (e) => {
            e.exports = "نام اندیکاتورها و مالیات";
        },
        9654: (e) => {
            e.exports = "نام اندیکاتورها";
        },
        99487: (e) => {
            e.exports = ["مقادیر OHLC"];
        },
        75991: (e) => {
            e.exports = "وضعیت بازار باز";
        },
        15474: (e) => {
            e.exports = "لوگو";
        },
        96073: (e) => {
            e.exports = "توضیحات بلند";
        },
        78905: (e) => {
            e.exports = "برچسب‌ها روی مقیاس قیمت";
        },
        37274: (e) => {
            e.exports = "مقادیر تغییر روز آخر";
        },
        19286: (e) => {
            e.exports = "چپ";
        },
        70500: (e) => {
            e.exports = "پول";
        },
        66653: (e) => {
            e.exports = "حاشیه‌ها";
        },
        76476: (e) => {
            e.exports = "وسط";
        },
        42502: (e) => {
            e.exports = "بدون همپوشانی";
        },
        49199: (e) => {
            e.exports = "هیچ‌کدام";
        },
        74343: (e) => {
            e.exports = "ناوبری";
        },
        47926: (e) => {
            e.exports = "حالت‌های مقیاس (A و L)";
        },
        43115: (e) => {
            e.exports = ["محورها"];
        },
        53224: (e) => {
            e.exports = "قرارگیری مقیاس‌ها";
        },
        79194: (e) => {
            e.exports = "خط وضعیت";
        },
        89053: (e) => {
            e.exports = ["نماد"];
        },
        35383: (e) => {
            e.exports = ["نام نماد"];
        },
        27767: (e) => {
            e.exports = "آخرین قیمت نماد";
        },
        40847: (e) => {
            e.exports = "قیمت بسته شدن روز قبل نماد";
        },
        50446: (e) => {
            e.exports = "پنل";
        },
        73908: (e) => {
            e.exports = "جداکننده‌های پنل";
        },
        36014: (e) => {
            e.exports = ["مقیاس درصدی"];
        },
        78621: (e) => {
            e.exports = "پیپ‌ها";
        },
        74823: (e) => {
            e.exports = "قیمت پیش/پس از بازار";
        },
        64859: (e) => {
            e.exports = "مقیاس قیمت";
        },
        76523: (e) => {
            e.exports = "مقدار قیمت و درصد";
        },
        21141: (e) => {
            e.exports = "راست";
        },
        40187: (e) => {
            e.exports = "حاشیه راست";
        },
        77705: (e) => {
            e.exports = ["رنگ نماد پس زمینه"];
        },
        26458: (e) => {
            e.exports = ["سایه بیشترین و کمترین"];
        },
        65994: (e) => {
            e.exports = "بالا";
        },
        92960: (e) => {
            e.exports = "تراز متن";
        },
        90581: (e) => {
            e.exports = "جهت متن";
        },
        67369: (e) => {
            e.exports = "عنوان";
        },
        31326: (e) => {
            e.exports = "عناوین";
        },
        23097: (e) => {
            e.exports = "تیکر";
        },
        82168: (e) => {
            e.exports = "تیکر و توضیحات";
        },
        43637: (e) => {
            e.exports = "مقیاس زمان";
        },
        97316: (e) => {
            e.exports = "فرمت ساعت زمان";
        },
        90801: (e) => {
            e.exports = "تریدینگ";
        },
        77534: (e) => {
            e.exports = "واحد";
        },
        1111: (e) => {
            e.exports = ["حجم"];
        },
        80170: (e) => {
            e.exports = "مقدار بر اساس مقیاس";
        },
        91322: (e) => {
            e.exports = "مقادیر";
        },        
        37174: (e) => {
            e.exports = "عمودی و افقی";
        },
        36426: (e) => {
            e.exports = "فقط عمودی";
        },
        44085: (e) => {
            e.exports = "عمودی";
        },
        57889: (e) => {
            e.exports = "تغییر قابل مشاهده بودن مقادیر OHLC";
        },
        35646: (e) => {
            e.exports = "تغییر قابل مشاهده بودن دکمه‌های ناوبری";
        },
        18644: (e) => {
            e.exports = "تغییر قابل مشاهده بودن وضعیت بازار باز";
        },
        45110: (e) => {
            e.exports = "تغییر قابل مشاهده بودن تغییر میله";
        },
        10349: (e) => {
            e.exports = "تغییر حاشیه پایین";
        },
        88161: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب‌های ارز و واحد";
        },
        84060: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب ارز";
        },
        99011: (e) => {
            e.exports = "تغییر رنگ پس‌زمینه نمودار";
        },
        72458: (e) => {
            e.exports = "تغییر نوع پس‌زمینه نمودار";
        },
        37034: (e) => {
            e.exports = "تغییر عرض نشانه‌گر";
        },
        29951: (e) => {
            e.exports = "تغییر رنگ نشانه‌گر";
        },
        92027: (e) => {
            e.exports = "تغییر سبک نشانه‌گر";
        },
        50457: (e) => {
            e.exports = "تغییر فرمت تاریخ";
        },
        7104: (e) => {
            e.exports = "تغییر روز هفته روی برچسب‌ها";
        },
        27764: (e) => {
            e.exports = "تغییر قابل مشاهده بودن خطوط شبکه";
        },
        88096: (e) => {
            e.exports = "تغییر رنگ خطوط شبکه افقی";
        },
        31325: (e) => {
            e.exports = "تغییر قابل مشاهده بودن عناوین اندیکاتورها";
        },
        99774: (e) => {
            e.exports = "تغییر قابل مشاهده بودن مقادیر اندیکاتورها";
        },
        96162: (e) => {
            e.exports = "تغییر قابل مشاهده بودن آرگومان‌های اندیکاتور";
        },
        59820: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب‌های نام اندیکاتورها و مالیات";
        },
        90512: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب‌های مقدار اندیکاتورها و مالیات";
        },
        50058: (e) => {
            e.exports = "تغییر قابل مشاهده بودن تغییر روز آخر";
        },
        97956: (e) => {
            e.exports = "تغییر شفافیت پس‌زمینه لژیون";
        },
        61061: (e) => {
            e.exports = "تغییر قابل مشاهده بودن پس‌زمینه لژیون";
        },
        37730: (e) => {
            e.exports = "تغییر قابل مشاهده بودن دکمه‌های پنل";
        },
        89032: (e) => {
            e.exports = "تغییر رنگ جداکننده‌های پنل";
        },
        35636: (e) => {
            e.exports = "تغییر حاشیه راست";
        },
        66601: (e) => {
            e.exports = "تغییر درصد حاشیه راست";
        },
        25616: (e) => {
            e.exports = "تغییر رنگ واترمارک نماد";
        },
        87159: (e) => {
            e.exports = "تغییر قابل مشاهده بودن واترمارک نماد";
        },
        26717: (e) => {
            e.exports = "تغییر قابل مشاهده بودن توضیحات نماد";
        },
        6091: (e) => {
            e.exports = "تغییر قابل مشاهده بودن فیلد نماد";
        },
        28741: (e) => {
            e.exports = "تغییر حالت آخرین مقدار نماد";
        },
        95071: (e) => {
            e.exports = "تغییر فرمت لژیون نماد";
        },
        47361: (e) => {
            e.exports = "تغییر قابل مشاهده بودن دکمه‌های حالت‌های مقیاس";
        },
        35065: (e) => {
            e.exports = "تغییر رنگ متن مقیاس‌ها";
        },
        84382: (e) => {
            e.exports = "تغییر اندازه فونت مقیاس‌ها";
        },
        12468: (e) => {
            e.exports = "تغییر رنگ خطوط مقیاس‌ها";
        },
        71589: (e) => {
            e.exports = "تغییر قابل مشاهده بودن شکست‌های جلسات";
        },
        15035: (e) => {
            e.exports = "تغییر عرض شکست‌های جلسات";
        },
        1579: (e) => {
            e.exports = "تغییر رنگ شکست‌های جلسات";
        },
        21460: (e) => {
            e.exports = "تغییر سبک شکست‌های جلسات";
        },
        76991: (e) => {
            e.exports = "تغییر فرمت ساعت زمان";
        },
        98905: (e) => {
            e.exports = "تغییر حاشیه بالا";
        },
        7011: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب واحد";
        },
        22722: (e) => {
            e.exports = "تغییر رنگ خطوط شبکه عمودی";
        },
        9455: (e) => {
            e.exports = "تغییر قابل مشاهده بودن مقادیر حجم";
        }        
    },
]);
