(self.webpackChunktradingview = self.webpackChunktradingview || []).push([
    [3175],
    {
        14281: (e) => {
            e.exports = "ارز";
        },
        60558: (e) => {
            e.exports = "حیوانات و طبیعت";
        },
        14232: (e) => {
            e.exports = "فعالیت";
        },
        57792: (e) => {
            e.exports = "پیکان‌ها";
        },
        33628: (e) => {
            e.exports = "حرکات و شکلک‌ها";
        },
        35305: (e) => {
            e.exports = "غذا و نوشیدنی";
        },
        49546: (e) => {
            e.exports = "پرچم‌ها";
        },
        72302: (e) => {
            e.exports = "اشیاء";
        },
        11739: (e) => {
            e.exports = "طبیعت";
        },
        96330: (e) => {
            e.exports = "لبخند‌ها و مردم";
        },
        6878: (e) => {
            e.exports = "نمادها";
        },
        77011: (e) => {
            e.exports = "نمادها و پرچم‌ها";
        },
        15426: (e) => {
            e.exports = "استفاده‌شده‌های اخیر";
        },
        15395: (e) => {
            e.exports = "سفر و مکان‌ها";
        },
        39176: (e) => {
            e.exports = "محتوا";
        },
        19022: (e) => {
            e.exports = "کانال‌ها";
        },
        82401: (e) => {
            e.exports = "نشانگرها";
        },
        50025: (e) => {
            e.exports = "دوره‌ها";
        },
        19661: (e) => {
            e.exports = ["ابزارهای حاشیه‌نویسی"];
        },
        44629: (e) => {
            e.exports = ["افزودن به موارد مورد علاقه"];
        },
        23969: (e) => {
            e.exports = "Arrows";
        },
        55939: (e) => {
            e.exports = "Brushes";
        },
        43884: (e) => {
            e.exports = "گن";
        },
        5816: (e) => {
            e.exports = ["ابزارهای گن و فیبوناچی"];
        },
        22146: (e) => {
            e.exports = ["اشکال هندسی"];
        },
        60925: (e) => {
            e.exports = ["نقطه"];
        },
        19570: (e) => {
            e.exports = "ایموجی‌ها";
        },
        88280: (e) => {
            e.exports = "امواج الیوت";
        },
        99289: (e) => {
            e.exports = ["پاک‌کن"];
        },
        97100: (e) => {
            e.exports = ["ابزارهای پیش‌بینی و اندازه‌گیری"];
        },
        22305: (e) => {
            e.exports = "فیبوناچی";
        },
        17517: (e) => {
            e.exports = ["عدم نمایش اشکال"];
        },
        96411: (e) => {
            e.exports = " پنهان کردن نوار ابزار رسم";
        },
        92464: (e) => {
            e.exports = "آیکون‌ها";
        },
        37057: (e) => {
            e.exports = ["قفل کردن ابزار های رسم"];
        },
        79165: (e) => {
            e.exports = "جادو";
        },
        37140: (e) => {
            e.exports = "حالت مغناطیسی نقشه‌ها را که نزدیک به نوارهای قیمتی قرار می‌گیرند به نزدیک‌ترین مقدار OHLC متصل می‌کند";
        },
        59607: (e) => {
            e.exports = "اندازه‌گیری";
        },
        79961: (e) => {
            e.exports = "اندازه‌گیر";
        },
        36551: (e) => {
            e.exports = "نقشه‌های جدید به همه نمودارهای موجود در چیدمان کپی می‌شوند و وقتی همان تیکر انتخاب می‌شود نشان داده می‌شوند";
        },
        25792: (e) => {
            e.exports = "اشکال";
        },
        63354: (e) => {
            e.exports = "نمایش نوار ابزار رسم";
        },
        49616: (e) => {
            e.exports = "نمایش نوار ابزار ابزارهای رسم مورد علاقه";
        },
        91977: (e) => {
            e.exports = "نمایش ابزارهای مخفی";
        },
        51072: (e) => {
            e.exports = "نمایش درخت اشیاء";
        },
        49421: (e) => {
            e.exports = ["ماندن در حالت ترسیم"];
        },
        84121: (e) => {
            e.exports = "برچسب‌ها";
        },
        85422: (e) => {
            e.exports = "مغناطیس قوی";
        },
        19693: (e) => {
            e.exports = "الگوها";
        },
        73359: (e) => {
            e.exports = "چنگال‌ها";
        },
        76091: (e) => {
            e.exports = "حذف ترسیم ها";
        },
        45286: (e) => {
            e.exports = "حذف اشیاء";
        },
        72482: (e) => {
            e.exports = ["حذف از موارد مورد علاقه"];
        },
        30513: (e) => {
            e.exports = "حذف {ترسیم ها}";
        },
        10049: (e) => {
            e.exports = " حذف {ترسیم ها} و {اندیکاتورها}";
        },
        55084: (e) => {
            e.exports = "حذف {اندیکاتورها}";
        },
        45265: (e) => {
            e.exports = "مغناطیس ضعیف";
        },
        20916: (e) => {
            e.exports = "متن و یادداشت‌ها";
        },
        18794: (e) => {
            e.exports = ["ابزارهای خط روند"];
        },
        89967: (e) => {
            e.exports = "بر اساس حجم";
        },
        38925: (e) => {
            e.exports = ["بزرگ نمایی"];
        },
        49895: (e) => {
            e.exports = ["کوچک نمایی"];
        },
        32868: (e) => {
            e.exports = "{hotKey_0} + کلیک بر رویه نمودار";
        },
        68125: (e) => {
            e.exports = "{hotKey_0} — دایره";
        },
        40234: (e) => {
            e.exports = "{hotKey_0} —  رسم یک خط مستقیم در زاویه‌های 45 درجه";
        },
        10289: (e) => {
            e.exports = "{hotKey_0} — افزایش‌های ثابت";
        },
        81591: (e) => {
            e.exports = "{hotKey_0} — مربع";
        },
        93030: (e) => {
            e.exports = ["{amount} نقشه"];
        },
        80437: (e) => {
            e.exports = ["{amount} اندیکاتور"];
        },
    },
]);
