(self.webpackChunktradingview = self.webpackChunktradingview || []).push([
    [3951],
    {
        14229: (e) => {
            e.exports = "نقطه";
        },
        16936: (e) => {
            e.exports = "بازگشت";
        },
        9898: (e) => {
            e.exports = "راست";
        },
        18511: (e) => {
            e.exports = "شمارش معکوس تا بسته شدن میله";
        },
        32409: (e) => {
            e.exports = ["شمای رنگی"];
        },
        90069: (e) => {
            e.exports = ["مقایسه"];
        },
        39176: (e) => {
            e.exports = "محتوا";
        },
        15803: (e) => {
            e.exports = "کپی لینک = تصویر نمودار";
        },
        20036: (e) => {
            e.exports = ["لغو"];
        },
        19022: (e) => {
            e.exports = "کانال‌ها";
        },
        8353: (e) => {
            e.exports = ["تغییر بازه"];
        },
        20788: (e) => {
            e.exports = "ستون‌های سبک نمودار";
        },
        86771: (e) => {
            e.exports = "کندل‌های سبک نمودار";
        },
        45290: (e) => {
            e.exports = "منطقه سبک نمودار";
        },
        97559: (e) => {
            e.exports = "میله‌های سبک نمودار";
        },
        18779: (e) => {
            e.exports = "پایه سبک نمودار";
        },
        90599: (e) => {
            e.exports = "کگی سبک نمودار";
        },
        41412: (e) => {
            e.exports = "منطقه HLC سبک نمودار";
        },
        51383: (e) => {
            e.exports = "کندل‌های توخالی سبک نمودار";
        },
        20424: (e) => {
            e.exports = "Heikin Ashi سبک نمودار";
        },
        28381: (e) => {
            e.exports = "بالا-پایین سبک نمودار";
        },
        87691: (e) => {
            e.exports = "خط سبک نمودار";
        },
        470: (e) => {
            e.exports = "شکست خط سبک نمودار";
        },
        14956: (e) => {
            e.exports = "خط با نشانگرهای سبک نمودار";
        },
        59393: (e) => {
            e.exports = "خط پله‌ای سبک نمودار";
        },
        59491: (e) => {
            e.exports = "نقطه و شکل سبک نمودار";
        },
        38385: (e) => {
            e.exports = "محدوده سبک نمودار";
        },
        91664: (e) => {
            e.exports = "رنکو سبک نمودار";
        },
        82838: (e) => {
            e.exports = "ردپای حجم سبک نمودار";
        },
        80395: (e) => {
            e.exports = "بستن منو";
        },
        82401: (e) => {
            e.exports = "اشاره‌گرها";
        },
        50025: (e) => {
            e.exports = "چرخه‌ها";
        },
        19661: (e) => {
            e.exports = ["ابزارهای توضیحی"];
        },
        44629: (e) => {
            e.exports = ["افزودن = موارد مورد علاقه"];
        },
        64498: (e) => {
            e.exports = "همه منابع";
        },
        95480: (e) => {
            e.exports = "اعمال این اندیکاتورها = کل طرح‌بندی";
        },
        23969: (e) => {
            e.exports = "پیکان‌ها";
        },
        28020: (e) => {
            e.exports = "خودکار (تناسب داده‌ها با صفحه)";
        },
        79852: (e) => {
            e.exports = "اوراق قرضه";
        },
        55939: (e) => {
            e.exports = "قلم‌موها";
        },
        40803: (e) => {
            e.exports = ["برو = تاریخ"];
        },
        43884: (e) => {
            e.exports = "گان";
        },
        5816: (e) => {
            e.exports = ["ابزارهای گان و فیبوناچی"];
        },
        22146: (e) => {
            e.exports = ["اشکال هندسی"];
        },
        60925: (e) => {
            e.exports = ["نقطه"];
        },
        66365: (e) => {
            e.exports = "تم رنگی تیره";
        },
        29601: (e) => {
            e.exports = ["شرح"];
        },
        22772: (e) => {
            e.exports = ["ترسیم"];
        },
        88280: (e) => {
            e.exports = "امواج الیوت";
        },
        99289: (e) => {
            e.exports = ["پاک‌کن"];
        },
        25790: (e) => {
            e.exports = "جلسه تمدید شده";
        },
        97100: (e) => {
            e.exports = ["ابزارهای پیش‌بینی و اندازه‌گیری"];
        },
        22305: (e) => {
            e.exports = "فیبوناچی";
        },
        11682: (e) => {
            e.exports = ["حالت تمام صفحه"];
        },
        15327: (e) => {
            e.exports = "تابع";
        },
        17517: (e) => {
            e.exports = ["عدم نمایش اشکال"];
        },
        82785: (e) => {
            e.exports = "معکوس کردن مقیاس";
        },
        64642: (e) => {
            e.exports = ["افزودن اندیکاتور"];
        },
        55149: (e) => {
            e.exports = "باز کردن درخت اشیا";
        },
        75687: (e) => {
            e.exports = "بارگذاری طرح‌بندی نمودار";
        },
        37057: (e) => {
            e.exports = ["قفل کردن ابزارهای رسم"];
        },
        95667: (e) => {
            e.exports = "قفل کردن نسبت قیمت = میله";
        },
        19567: (e) => {
            e.exports = "انتقال مقیاس = چپ";
        },
        76300: (e) => {
            e.exports = "انتقال مقیاس = راست";
        },
        56854: (e) => {
            e.exports = "بازگرداندن نمودار";
        },
        22221: (e) => {
            e.exports = "جلو بردن نمودار";
        },
        79165: (e) => {
            e.exports = "جادو";
        },
        37140: (e) => {
            e.exports = "حالت آهن‌ربا رسم‌های قرار داده شده نزدیک = میله‌های قیمت را = نزدیک‌ترین مقدار OHLC متصل می‌کند";
        },
        72357: (e) => {
            e.exports = "مدیریت نقشه‌های طرح‌بندی";
        },
        59607: (e) => {
            e.exports = "اندازه‌گیری";
        },
        79961: (e) => {
            e.exports = "اندازه‌گیر";
        },
        78633: (e) => {
            e.exports = "ادغام تمام مقیاس‌ها = چپ";
        },
        308: (e) => {
            e.exports = "ادغام تمام مقیاس‌ها = راست";
        },
        29673: (e) => {
            e.exports = "هیچ بازاری با معیارهای شما مطابقت ندارد";
        },
        41379: (e) => {
            e.exports = "هیچ نمادی با معیارهای شما مطابقت ندارد";
        },
        45850: (e) => {
            e.exports = "هیچ چیزی با معیارهای شما مطابقت ندارد";
        },
        36551: (e) => {
            e.exports = "نقشه‌های جدید = تمام نمودارها در طرح‌بندی تکثیر شده و هنگام انتخاب همان تیکر نمایش داده می‌شوند";
        },
        19407: (e) => {
            e.exports = "نقشه‌های جدید = صورت جهانی همگام‌سازی خواهند شد";
        },
        77989: (e) => {
            e.exports = "نقشه‌های جدید در طرح‌بندی همگام‌سازی خواهند شد";
        },
        19724: (e) => {
            e.exports = "منابع";
        },
        62571: (e) => {
            e.exports = "ذخیره طرح‌بندی نمودار";
        },
        35264: (e) => {
            e.exports = ["فقط نمودار مقیاس قیمت"];
        },
        52298: (e) => {
            e.exports = ["جستجو"];
        },
        78842: (e) => {
            e.exports = "جستجوی ابزار یا تابع";
        },
        13269: (e) => {
            e.exports = "انتخاب منبع";
        },
        90417: (e) => {
            e.exports = ["تنفس معاملاتی"];
        },
        25792: (e) => {
            e.exports = "اشکال";
        },
        91977: (e) => {
            e.exports = "نمایش ابزارهای مخفی";
        },
        51072: (e) => {
            e.exports = "نمایش درخت اشیا";
        },
        49421: (e) => {
            e.exports = ["ماندن در حالت ترسیم"];
        },
        85422: (e) => {
            e.exports = "آهن‌ربای قوی";
        },
        89053: (e) => {
            e.exports = ["نماد"];
        },
        48490: (e) => {
            e.exports = "نماد و توضیحات";
        },
        79791: (e) => {
            e.exports = "برچسب نام نماد";
        },
        12014: (e) => {
            e.exports = "اطلاعات نماد";
        },
        78001: (e) => {
            e.exports = "برچسب آخرین مقدار نماد";
        },
        99983: (e) => {
            e.exports = "جستجوی نماد";
        },
        35888: (e) => {
            e.exports = "همگام‌سازی نقشه‌ها = همه نمودارها";
        },
        19693: (e) => {
            e.exports = "الگوها";
        },
        73359: (e) => {
            e.exports = "چنگال‌ها";
        },
        4037: (e) => {
            e.exports = "دکمه مثبت";
        },
        96032: (e) => {
            e.exports = "خط قیمت بسته شدن روز قبل";
        },
        99530: (e) => {
            e.exports = ["خط قیمت"];
        },
        90612: (e) => {
            e.exports = "جستجوی اخیر";
        },
        31273: (e) => {
            e.exports = "جلسه معمولی";
        },
        76091: (e) => {
            e.exports = "حذف نقشه‌ها";
        },
        20378: (e) => {
            e.exports = "حذف اندیکاتورها";
        },
        57869: (e) => {
            e.exports = "حذف همه اندیکاتورها و ابزارهای رسم";
        },
        72482: (e) => {
            e.exports = ["حذف از موارد مورد علاقه"];
        },
        34465: (e) => {
            e.exports = ["تنظیمات پیش‌فرض نمودار"];
        },
        45417: (e) => {
            e.exports = "بازنشانی مقیاس قیمت";
        },
        75521: (e) => {
            e.exports = "بازنشانی مقیاس زمان";
        },
        45265: (e) => {
            e.exports = "آهن‌ربای ضعیف";
        },
        20916: (e) => {
            e.exports = "متن و یادداشت‌ها";
        },
        18794: (e) => {
            e.exports = ["ابزارهای خط روند"];
        },
        64185: (e) => {
            e.exports = "تایپ کنید برای جستجوی نقشه‌ها، توابع و تنظیمات";
        },
        89967: (e) => {
            e.exports = "بر اساس حجم";
        },
        38925: (e) => {
            e.exports = ["بزرگ نمایی"];
        },
        49895: (e) => {
            e.exports = ["کوچک نمایی"];
        },
        12629: (e) => {
            e.exports = "کالا";
        },
        87592: (e) => {
            e.exports = "CFD";
        },
        65558: (e) => {
            e.exports = "تغییر قابل مشاهده بودن ایده‌ها در نمودار";
        },
        59820: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب‌های نام اندیکاتورها و مالیات";
        },
        90512: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب‌های مقدار اندیکاتورها و مالیات";
        },
        50393: (e) => {
            e.exports = "تغییر قابل مشاهده بودن خطوط قیمت پیش/پس بازار";
        },
        8448: (e) => {
            e.exports = "رمزارز";
        },
        67245: (e) => {
            e.exports = "DR";
        },
        88720: (e) => {
            e.exports = "اقتصاد";
        },
        39512: (e) => {
            e.exports = "فارکس";
        },
        81859: (e) => {
            e.exports = "آتی";
        },
        12754: (e) => {
            e.exports = "شاخص";
        },
        60804: (e) => {
            e.exports = "شاخص‌ها";
        },
        36931: (e) => {
            e.exports = "سهام";
        },
        95612: (e) => {
            e.exports = "همگام‌سازی نقشه‌ها";
        },
        32868: (e) => {
            e.exports = "{hotKey_0} + کلیک روی نمودار";
        },
        68125: (e) => {
            e.exports = "{hotKey_0} — دایره";
        },
        40234: (e) => {
            e.exports = "{hotKey_0} — رسم خط راست در زوایای 45 درجه";
        },
        10289: (e) => {
            e.exports = "{hotKey_0} — افزایش ثابت";
        },
        81591: (e) => {
            e.exports = "{hotKey_0} — مربع";
        }
        
    },
]);
