(self.webpackChunktradingview = self.webpackChunktradingview || []).push([
    [2285],
    {
        72171: (t) => {
            t.exports = "مرکز";
        },
        91757: (t) => {
            t.exports = ["پایین"];
        },
        22192: (t) => {
            t.exports = "روزها";
        },
        63099: (t) => {
            t.exports = "ساعت‌ها";
        },
        77405: (t) => {
            t.exports = "افقی";
        },
        66304: (t) => {
            t.exports = ["ورودی‌ها"];
        },
        19286: (t) => {
            t.exports = "چپ";
        },
        76476: (t) => {
            t.exports = "وسط";
        },
        28134: (t) => {
            t.exports = "دقیقه‌ها";
        },
        71129: (t) => {
            t.exports = "ثانیه‌ها";
        },
        21141: (t) => {
            t.exports = "راست";
        },
        21594: (t) => {
            t.exports = "هفته‌ها";
        },
        26458: (t) => {
            t.exports = ["سایه بیشترین و کمترین"];
        },
        65994: (t) => {
            t.exports = "بالا";
        },
        92960: (t) => {
            t.exports = "تراز متن";
        },
        90581: (t) => {
            t.exports = "جهت متن";
        },
        44085: (t) => {
            t.exports = "عمودی";
        },
        13355: (t) => {
            t.exports = "تغییر {title} روزها به";
        },
        41377: (t) => {
            t.exports = "تغییر {title} روزها از";
        },
        35388: (t) => {
            t.exports = "تغییر {title} ساعت‌ها از";
        },
        78586: (t) => {
            t.exports = "تغییر {title} ساعت‌ها به";
        },
        59635: (t) => {
            t.exports = "تغییر {title} ماه‌ها از";
        },
        74266: (t) => {
            t.exports = "تغییر {title} ماه‌ها به";
        },
        91633: (t) => {
            t.exports = "تغییر {title} دقیقه‌ها به";
        },
        15106: (t) => {
            t.exports = "تغییر {title} دقیقه‌ها از";
        },
        66161: (t) => {
            t.exports = "تغییر {title} ثانیه‌ها به";
        },
        2822: (t) => {
            t.exports = "تغییر {title} ثانیه‌ها از";
        },
        21339: (t) => {
            t.exports = "تغییر {title} هفته‌ها از";
        },
        68643: (t) => {
            t.exports = "تغییر {title} هفته‌ها به";
        },
        30810: (t) => {
            t.exports = "تغییر قابل مشاهده بودن {title} روی تیک‌ها";
        },
        24941: (t) => {
            t.exports = "تغییر قابل مشاهده بودن {title} روی هفته‌ها";
        },
        8917: (t) => {
            t.exports = "تغییر قابل مشاهده بودن {title} روی {ranges}";
        },
        29088: (t) => {
            t.exports = "تغییر قابل مشاهده بودن {title} روی روزها";
        },
        68971: (t) => {
            t.exports = "تغییر قابل مشاهده بودن {title} روی ساعت‌ها";
        },
        64370: (t) => {
            t.exports = "تغییر قابل مشاهده بودن {title} روی دقیقه‌ها";
        },
        6659: (t) => {
            t.exports = "تغییر قابل مشاهده بودن {title} روی ماه‌ها";
        },
        46948: (t) => {
            t.exports = "تغییر قابل مشاهده بودن {title} روی ثانیه‌ها";
        },
        82211: (t) => {
            t.exports = ["روزها"];
        },
        33486: (t) => {
            t.exports = "روزها به";
        },
        14077: (t) => {
            t.exports = "روزها از";
        },
        3143: (t) => {
            t.exports = ["ساعت‌ها"];
        },
        84775: (t) => {
            t.exports = "ساعت‌ها از";
        },
        11255: (t) => {
            t.exports = "ساعت‌ها به";
        },
        58964: (t) => {
            t.exports = ["ماه‌ها"];
        },
        71770: (t) => {
            t.exports = "ماه‌ها از";
        },
        37179: (t) => {
            t.exports = "ماه‌ها به";
        },
        16465: (t) => {
            t.exports = ["دقیقه‌ها"];
        },
        72317: (t) => {
            t.exports = "دقیقه‌ها به";
        },
        25586: (t) => {
            t.exports = "دقیقه‌ها از";
        },
        32925: (t) => {
            t.exports = "ثانیه‌ها";
        },
        39017: (t) => {
            t.exports = "ثانیه‌ها به";
        },
        6049: (t) => {
            t.exports = "ثانیه‌ها از";
        },
        93016: (t) => {
            t.exports = "هفته‌ها";
        },
        32002: (t) => {
            t.exports = "هفته‌ها از";
        },
        28091: (t) => {
            t.exports = "هفته‌ها به";
        },
        59523: (t) => {
            t.exports = "تیک‌ها";
        }
    },
]);
