(self.webpackChunktradingview = self.webpackChunktradingview || []).push([
    [2578],
    {
        22353: (e) => {
            e.exports = ["‎(O + H + L + C)/4"];
        },
        94884: (e) => {
            e.exports = ["‎(H + L + C)/3"];
        },
        10591: (e) => {
            e.exports = ["‎(H + L)/2"];
        },
        63243: (e) => {
            e.exports = ["نمایش رنگ کندل‌ها بر اساس قیمت پایانی روز قبل"];
        },
        15857: (e) => {
            e.exports = "خط بسته شدن";
        },
        9994: (e) => {
            e.exports = "تنظیم داده‌ها برای سود سهام";
        },
        10989: (e) => {
            e.exports = "تنظیم برای تغییرات قرارداد";
        },
        70816: (e) => {
            e.exports = "میانگین بسته شدن";
        },
        50430: (e) => {
            e.exports = ["خط پایین"];
        },
        83760: (e) => {
            e.exports = "بدنه";
        },
        72269: (e) => {
            e.exports = ["حاشیه"];
        },
        7445: (e) => {
            e.exports = ["سطح پایه"];
        },
        47586: (e) => {
            e.exports = "پیشنهاد و درخواست";
        },
        39667: (e) => {
            e.exports = "میله‌های نزولی";
        },
        87151: (e) => {
            e.exports = "رنگ نزولی";
        },
        81285: (e) => {
            e.exports = "تغییر داده";
        },
        4329: (e) => {
            e.exports = ["پیش‌فرض"];
        },
        86846: (e) => {
            e.exports = "پر کردن";
        },
        58747: (e) => {
            e.exports = ["پر کردن منطقه بالا"];
        },
        11157: (e) => {
            e.exports = ["پر کردن منطقه پایین"];
        },
        86953: (e) => {
            e.exports = "میله‌های HLC";
        },
        39292: (e) => {
            e.exports = "بالاترین و پایین‌ترین";
        },
        83678: (e) => {
            e.exports = "خط بالا";
        },
        75310: (e) => {
            e.exports = "خط پایین";
        },
        15107: (e) => {
            e.exports = "آخرین";
        },
        6350: (e) => {
            e.exports = "پیش/پس از بازار";
        },
        62521: (e) => {
            e.exports = "پس‌زمینه ساعات پیش/پس از بازار";
        },
        73947: (e) => {
            e.exports = ["دقت"];
        },
        8094: (e) => {
            e.exports = "بسته شدن روز قبل";
        },
        77986: (e) => {
            e.exports = "خطوط قیمت";
        },
        24248: (e) => {
            e.exports = "منبع قیمت";
        },
        94089: (e) => {
            e.exports = "میله‌های پیش‌بینی صعودی";
        },
        80293: (e) => {
            e.exports = "کندل‌های پیش‌بینی";
        },
        5704: (e) => {
            e.exports = "میله‌های پیش‌بینی نزولی";
        },
        29881: (e) => {
            e.exports = "نمایش قیمت‌های واقعی روی مقیاس قیمت (به جای قیمت Heikin-Ashi)";
        },
        57417: (e) => {
            e.exports = ["خط بالا"];
        },
        55314: (e) => {
            e.exports = ["میله‌های نازک"];
        },
        87492: (e) => {
            e.exports = "منطقه زمانی";
        },
        5536: (e) => {
            e.exports = "رنگ صعودی";
        },
        83610: (e) => {
            e.exports = "میله‌های صعودی";
        },
        23500: (e) => {
            e.exports = "استفاده از تسویه به عنوان بسته شدن در بازه روزانه";
        },
        35612: (e) => {
            e.exports = "استفاده از میله‌های وزن‌دار حجمی";
        },
        30792: (e) => {
            e.exports = "شمعی";
        },
        55740: (e) => {
            e.exports = "تغییر میله‌های HLC";
        },
        68927: (e) => {
            e.exports = "تغییر عرض خط میانگین بسته شدن";
        },
        30385: (e) => {
            e.exports = "تغییر رنگ خط میانگین بسته شدن";
        },
        97008: (e) => {
            e.exports = "تغییر رنگ پر کردن منطقه";
        },
        6610: (e) => {
            e.exports = "تغییر عرض خط منطقه";
        },
        661: (e) => {
            e.exports = "تغییر رنگ خط منطقه";
        },
        1316: (e) => {
            e.exports = "تغییر منبع قیمت منطقه";
        },
        29180: (e) => {
            e.exports = "تغییر رنگ خط درخواست";
        },
        31547: (e) => {
            e.exports = "تغییر سطح پایه";
        },
        4164: (e) => {
            e.exports = "تغییر رنگ خط پایین پایه";
        },
        38990: (e) => {
            e.exports = "تغییر عرض خط پایین پایه";
        },
        73163: (e) => {
            e.exports = "تغییر رنگ پر کردن منطقه پایین پایه";
        },
        12673: (e) => {
            e.exports = "تغییر رنگ پر کردن منطقه بالای پایه";
        },
        56819: (e) => {
            e.exports = "تغییر منبع قیمت پایه";
        },
        68621: (e) => {
            e.exports = "تغییر رنگ خط بالای پایه";
        },
        35339: (e) => {
            e.exports = "تغییر عرض خط بالای پایه";
        },
        76804: (e) => {
            e.exports = "تغییر رنگ میله صعودی";
        },
        71816: (e) => {
            e.exports = "تغییر رنگ میله نزولی";
        },
        36703: (e) => {
            e.exports = "تغییر رنگ خط پیشنهاد";
        },
        29353: (e) => {
            e.exports = "تغییر رنگ میله‌ها بر اساس بسته شدن قبلی";
        },
        85709: (e) => {
            e.exports = "تغییر رنگ ستون صعودی";
        },
        12155: (e) => {
            e.exports = "تغییر رنگ ستون نزولی";
        },
        66890: (e) => {
            e.exports = "تغییر منبع قیمت ستون";
        },
        71809: (e) => {
            e.exports = "تغییر اعشار";
        },
        31317: (e) => {
            e.exports = "تغییر رنگ ساعات اضافه";
        },
        60944: (e) => {
            e.exports = "تغییر رنگ خط بالا و پایین قیمت";
        },
        83708: (e) => {
            e.exports = "تغییر عرض خط بالا و پایین قیمت";
        },
        81080: (e) => {
            e.exports = "تغییر رنگ بدنه بالا و پایین";
        },
        30033: (e) => {
            e.exports = "تغییر قابل مشاهده بودن بدنه بالا و پایین";
        },
        76885: (e) => {
            e.exports = "تغییر رنگ حاشیه بالا و پایین";
        },
        79236: (e) => {
            e.exports = "تغییر قابل مشاهده بودن حاشیه‌های بالا و پایین";
        },
        42981: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب‌های بالا و پایین";
        },
        31937: (e) => {
            e.exports = "تغییر رنگ برچسب‌های بالا و پایین";
        },
        87828: (e) => {
            e.exports = "تغییر رنگ خط";
        },
        17119: (e) => {
            e.exports = "تغییر منبع قیمت خط";
        },
        69125: (e) => {
            e.exports = "تغییر عرض خط";
        },
        49973: (e) => {
            e.exports = "تغییر رنگ بازار پس";
        },
        5969: (e) => {
            e.exports = "تغییر رنگ خط بازار پس";
        },
        50393: (e) => {
            e.exports = "تغییر قابل مشاهده بودن خطوط قیمت پیش/پس بازار";
        },
        46257: (e) => {
            e.exports = "تغییر رنگ پیش بازار";
        },
        60852: (e) => {
            e.exports = "تغییر رنگ خط پیش بازار";
        },
        91183: (e) => {
            e.exports = "تغییر رنگ خط بسته شدن قبلی";
        },
        87631: (e) => {
            e.exports = "تغییر عرض خط بسته شدن قبلی";
        },
        77640: (e) => {
            e.exports = "تغییر رنگ خط قیمت";
        },
        97322: (e) => {
            e.exports = "تغییر عرض خط قیمت";
        },
        35116: (e) => {
            e.exports = "تغییر سبک میله‌های محدوده";
        },
        28143: (e) => {
            e.exports = "تغییر میله‌های نازک محدوده";
        },
        75986: (e) => {
            e.exports = "تغییر رنگ فتیله Renko نزولی";
        },
        7747: (e) => {
            e.exports = "تغییر رنگ فتیله Renko صعودی";
        },
        9473: (e) => {
            e.exports = "تغییر قابل مشاهده بودن فتیله Renko";
        },
        39783: (e) => {
            e.exports = "تغییر نمایش قیمت‌های واقعی روی مقیاس قیمت (به جای قیمت Heiken-Ashi)";
        },
        72886: (e) => {
            e.exports = "تغییر میله‌های نازک";
        },
        95108: (e) => {
            e.exports = "تغییر استفاده از میله‌های وزن‌دار حجمی";
        },
        5464: (e) => {
            e.exports = "تغییر رنگ حاشیه صعودی {candleType}";
        },
        61118: (e) => {
            e.exports = "تغییر رنگ صعودی {candleType}";
        },
        60164: (e) => {
            e.exports = "تغییر رنگ فتیله نزولی {candleType}";
        },
        45543: (e) => {
            e.exports = "تغییر رنگ فتیله صعودی {candleType}";
        },
        39987: (e) => {
            e.exports = "تغییر قابل مشاهده بودن فتیله {candleType}";
        },
        47202: (e) => {
            e.exports = "تغییر قابل مشاهده بودن بدنه {candleType}";
        },
        23986: (e) => {
            e.exports = "تغییر قابل مشاهده بودن حاشیه {candleType}";
        },
        92330: (e) => {
            e.exports = "تغییر رنگ حاشیه نزولی {candleType}";
        },
        36320: (e) => {
            e.exports = "تغییر رنگ نزولی {candleType}";
        },
        79088: (e) => {
            e.exports = "تغییر رنگ میله مرزی نزولی {chartType}";
        },
        11107: (e) => {
            e.exports = "تغییر رنگ میله مرزی صعودی {chartType}";
        },
        85503: (e) => {
            e.exports = "تغییر رنگ نزولی {chartType}";
        },
        61250: (e) => {
            e.exports = "تغییر رنگ میله مرزی پیش‌بینی صعودی {chartType}";
        },
        18465: (e) => {
            e.exports = "تغییر رنگ میله پیش‌بینی نزولی {chartType}";
        },
        50453: (e) => {
            e.exports = "تغییر رنگ میله پیش‌بینی صعودی {chartType}";
        },
        59414: (e) => {
            e.exports = "تغییر رنگ صعودی {chartType}";
        },
        21547: (e) => {
            e.exports = "تغییر ویژگی {inputName}";
        },
        42390: (e) => {
            e.exports = "تنظیم داده‌ها برای سود سهام";
        },
        99511: (e) => {
            e.exports = "تنظیم برای تغییرات قرارداد";
        },
        75165: (e) => {
            e.exports = ["شمعی توخالی"];
        },
        18995: (e) => {
            e.exports = ["محدوده‌ها"];
        },
        47500: (e) => {
            e.exports = ["Renko"];
        },
        98402: (e) => {
            e.exports = "استفاده از تسویه به عنوان بسته شدن در بازه روزانه";
        }
    },
]);
