(self.webpackChunktradingview = self.webpackChunktradingview || []).push([
    [3236],
    {
        14229: (e) => {
            e.exports = "نقطه";
        },
        6174: (e) => {
            e.exports = "روزها";
        },
        5285: (e) => {
            e.exports = "ساعت‌ها";
        },
        79410: (e) => {
            e.exports = "ماه‌ها";
        },
        37830: (e) => {
            e.exports = "دقیقه‌ها";
        },
        25042: (e) => {
            e.exports = "هفته‌ها";
        },
        74787: (e) => {
            e.exports = "روزها";
        },
        62346: (e) => {
            e.exports = "ساعت‌ها";
        },
        94328: (e) => {
            e.exports = "ماه‌ها";
        },
        57470: (e) => {
            e.exports = "دقیقه‌ها";
        },
        74973: (e) => {
            e.exports = "ثانیه‌ها";
        },
        48801: (e) => {
            e.exports = "محدوده‌ها";
        },
        86614: (e) => {
            e.exports = "هفته‌ها";
        },
        30426: (e) => {
            e.exports = "تیک‌ها";
        },
        43001: (e) => {
            e.exports = "کپی تصویر";
        },
        7367: (e) => {
            e.exports = "کپی لینک";
        },
        45888: (e) => {
            e.exports = "عکس نمودار";
        },
        74207: (e) => {
            e.exports = "تنظیمات نمودار";
        },
        54777: (e) => {
            e.exports = ["افزودن"];
        },
        95798: (e) => {
            e.exports = "افزودن بازه سفارشی";
        },
        44629: (e) => {
            e.exports = ["افزودن به موارد مورد علاقه"];
        },
        15795: (e) => {
            e.exports = "همه طرح‌بندی‌های من";
        },
        88368: (e) => {
            e.exports = "همه تغییرات ذخیره شد";
        },
        84232: (e) => {
            e.exports = ["نحوه نمایش"];
        },
        39011: (e) => {
            e.exports = "دانلود تصویر";
        },
        43399: (e) => {
            e.exports = "قالب‌های پیش‌فرض";
        },
        29313: (e) => {
            e.exports = "هر کسی با لینک می‌تواند مشاهده و کپی کند";
        },
        83127: (e) => {
            e.exports = "اندیکاتورهای مورد علاقه";
        },
        33959: (e) => {
            e.exports = "موارد مورد علاقه";
        },
        11682: (e) => {
            e.exports = ["حالت تمام صفحه"];
        },
        15812: (e) => {
            e.exports = "قالب‌های اندیکاتور";
        },
        61142: (e) => {
            e.exports = ["اندیکاتورها"];
        },
        74527: (e) => {
            e.exports = "اندیکاتورها و استراتژی‌ها";
        },
        79353: (e) => {
            e.exports = "باز کردن دیالوگ بازه";
        },
        55520: (e) => {
            e.exports = "باز کردن نمودار در پنجره پاپ آپ";
        },
        38543: (e) => {
            e.exports = "باز کردن در تب جدید";
        },
        75687: (e) => {
            e.exports = "بارگذاری طرح‌بندی نمودار";
        },
        75789: (e) => {
            e.exports = "بارگذاری طرح‌بندی";
        },
        90879: (e) => {
            e.exports = "در حال بارگذاری...";
        },
        80959: (e) => {
            e.exports = "ایجاد یک کپی";
        },
        58219: (e) => {
            e.exports = "مدیریت طرح‌بندی‌ها";
        },
        38554: (e) => {
            e.exports = "قالب‌های من";
        },
        14605: (e) => {
            e.exports = "عدد یا {hotKey_0}";
        },
        85520: (e) => {
            e.exports = ["ذخیره"];
        },
        92093: (e) => {
            e.exports = "ذخیره قالب اندیکاتور";
        },
        87409: (e) => {
            e.exports = "ذخیره تمام نمودارها برای تمام نمادها و بازه‌های زمانی در طرح‌بندی شما";
        },
        11680: (e) => {
            e.exports = "ذخیره طرح‌بندی";
        },
        27077: (e) => {
            e.exports = "اشتراک‌گذاری";
        },
        20987: (e) => {
            e.exports = "به سادگی تایپ کنید تا این جعبه جستجو را در نمودار بیاورید";
        },
        99983: (e) => {
            e.exports = "جستجوی نماد";
        },
        43959: (e) => {
            e.exports = ["جستجوی سریع"];
        },
        70728: (e) => {
            e.exports = ["حالت بعدی {hint}"];
        },
        72482: (e) => {
            e.exports = ["حذف از موارد مورد علاقه"];
        },
        35038: (e) => {
            e.exports = "تغییر نام";
        },
        88513: (e) => {
            e.exports = "گرفتن عکس";
        },
        32916: (e) => {
            e.exports = ["دوره زمانی"];
        },
        99746: (e) => {
            e.exports = "توییت تصویر";
        },
        80323: (e) => {
            e.exports = ["حالت قبلی {hint}"];
        },
        23687: (e) => {
            e.exports = "هنوز اندیکاتور مورد علاقه‌ای ندارید";
        }        
    },
]);
