(self.webpackChunktradingview = self.webpackChunktradingview || []).push([
    [344],
    {
        63227: (e) => {
            e.exports = "#{count} (bar)";
        },
        9671: (e) => {
            e.exports = "#{count} (price, bar)";
        },
        91282: (e) => {
            e.exports = "#1 (bar)";
        },
        1961: (e) => {
            e.exports = "#1 (price)";
        },
        12706: (e) => {
            e.exports = "#1 (price, bar)";
        },
        92195: (e) => {
            e.exports = "#1 (vertical position %, bar)";
        },
        66187: (e) => {
            e.exports = ["خط میانی"];
        },
        5066: (e) => {
            e.exports = "%";
        },
        89795: (e) => {
            e.exports = "پادساعتگرد";
        },
        43809: (e) => {
            e.exports = "ضرایب به عنوان درصد";
        },
        40054: (e) => {
            e.exports = ["رنگ"];
        },
        47737: (e) => {
            e.exports = "حالت آمار فشرده";
        },
        4639: (e) => {
            e.exports = ["مختصات"];
        },
        76655: (e) => {
            e.exports = "نقدی";
        },
        99120: (e) => {
            e.exports = ["کانال"];
        },
        60066: (e) => {
            e.exports = "تغییر در پیپ‌ها";
        },
        36150: (e) => {
            e.exports = "زاویه";
        },
        38280: (e) => {
            e.exports = "زوایا";
        },
        95264: (e) => {
            e.exports = "اندازه حساب";
        },
        85160: (e) => {
            e.exports = "همیشه نمایش آمار";
        },
        54189: (e) => {
            e.exports = ["کمان‌ها"];
        },
        34674: (e) => {
            e.exports = "میانگین HL در تیک‌های کوچک";
        },
        17608: (e) => {
            e.exports = ["برچسب‌های پایین"];
        },
        48848: (e) => {
            e.exports = ["حاشیه"];
        },
        72269: (e) => {
            e.exports = ["حاشیه"];
        },
        27331: (e) => {
            e.exports = ["پس‌زمینه"];
        },
        66282: (e) => {
            e.exports = "پس‌زمینه #1";
        },
        19949: (e) => {
            e.exports = "دامنه میله‌ها";
        },
        81260: (e) => {
            e.exports = ["شبکه"];
        },
        67114: (e) => {
            e.exports = "محدوده تاریخ/زمان";
        },
        37067: (e) => {
            e.exports = "جابجایی (قیمت، میله)";
        },
        75460: (e) => {
            e.exports = "فاصله";
        },
        46211: (e) => {
            e.exports = "سنجاق ایموجی";
        },
        46001: (e) => {
            e.exports = ["قیمت ورود"];
        },
        1220: (e) => {
            e.exports = ["بسط"];
        },
        71116: (e) => {
            e.exports = "امتداد پایین";
        },
        45809: (e) => {
            e.exports = ["امتداد از چپ"];
        },
        25892: (e) => {
            e.exports = "امتداد خط چپ";
        },
        13611: (e) => {
            e.exports = ["امتداد خطوط"];
        },
        3304: (e) => {
            e.exports = ["امتداد خطوط به چپ"];
        },
        83095: (e) => {
            e.exports = "امتداد خطوط به راست";
        },
        14025: (e) => {
            e.exports = ["امتداد از راست"];
        },
        74395: (e) => {
            e.exports = "متداد خط راست";
        },
        85197: (e) => {
            e.exports = " امتداد بالا";
        },
        17006: (e) => {
            e.exports = ["اندازه قلم"];
        },
        31343: (e) => {
            e.exports = "متن خطا";
        },
        28565: (e) => {
            e.exports = "پس‌زمینه خطا";
        },
        87931: (e) => {
            e.exports = ["بادبزن‌ها"];
        },
        39836: (e) => {
            e.exports = "سطوح فیب بر اساس مقیاس لگاریتمی";
        },
        10578: (e) => {
            e.exports = [" دایره‌های کامل"];
        },
        25264: (e) => {
            e.exports = ["میله‌های HL"];
        },
        66049: (e) => {
            e.exports = ["میله‌های OC"];
        },
        27531: (e) => {
            e.exports = "اندازه لات";
        },
        99180: (e) => {
            e.exports = "باند پایینی #1";
        },
        53861: (e) => {
            e.exports = "باند پایینی #2";
        },
        44775: (e) => {
            e.exports = "باند پایینی #3";
        },
        85206: (e) => {
            e.exports = ["برچسب"];
        },
        75332: (e) => {
            e.exports = "متن برچسب";
        },
        14773: (e) => {
            e.exports = ["برچسب پس‌زمینه"];
        },
        37126: (e) => {
            e.exports = "خط سطوح";
        },
        79106: (e) => {
            e.exports = ["سطوح"];
        },
        95610: (e) => {
            e.exports = ["خط سطوح"];
        },
        79307: (e) => {
            e.exports = ["برچسب‌های چپ"];
        },
        49286: (e) => {
            e.exports = "خط - HL/2";
        },
        17676: (e) => {
            e.exports = ["خط - باز"];
        },
        47669: (e) => {
            e.exports = "خط - بسته";
        },
        71899: (e) => {
            e.exports = ["خط - بالا"];
        },
        83394: (e) => {
            e.exports = "خط - پایین";
        },
        60489: (e) => {
            e.exports = "رنگ خط";
        },
        53889: (e) => {
            e.exports = "حالت";
        },
        95543: (e) => {
            e.exports = "ماه‌ها";
        },
        85041: (e) => {
            e.exports = "خط میانی";
        },
        24510: (e) => {
            e.exports = "نقطه میانی";
        },
        22213: (e) => {
            e.exports = "پس‌زمینه منبع";
        },
        15500: (e) => {
            e.exports = " حاشیه منبع";
        },
        79238: (e) => {
            e.exports = "متن منبع";
        },
        37249: (e) => {
            e.exports = "آمار";
        },
        28712: (e) => {
            e.exports = ["موقعیت آمار"];
        },
        50948: (e) => {
            e.exports = ["رنگ محدوده زیان"];
        },
        56119: (e) => {
            e.exports = "سطح توقف";
        },
        69835: (e) => {
            e.exports = " متن موفقیت";
        },
        91141: (e) => {
            e.exports = " پس‌زمینه موفقیت";
        },
        2694: (e) => {
            e.exports = "تغییر درصدی";
        },
        650: (e) => {
            e.exports = "درصدها";
        },
        25684: (e) => {
            e.exports = ["قیمت"];
        },
        23675: (e) => {
            e.exports = "برچسب قیمت";
        },
        75675: (e) => {
            e.exports = "برچسب‌های قیمت";
        },
        16103: (e) => {
            e.exports = ["سطوح قیمت"];
        },
        46964: (e) => {
            e.exports = ["محدوده قیمتی"];
        },
        59771: (e) => {
            e.exports = ["سبت قیمت/میله"];
        },
        29072: (e) => {
            e.exports = ["قیمت‌ها"];
        },
        2635: (e) => {
            e.exports = "سطح سود";
        },
        33886: (e) => {
            e.exports = "محدوده‌ها و نسبت‌ها";
        },
        24186: (e) => {
            e.exports = ["معکوس"];
        },
        91367: (e) => {
            e.exports = " برچسب‌های سمت راست";
        },
        63833: (e) => {
            e.exports = "ریسک";
        },
        95545: (e) => {
            e.exports = "موج";
        },
        10209: (e) => {
            e.exports = ["برچسب‌های بالا"];
        },
        98001: (e) => {
            e.exports = "پس‌زمینه هدف";
        },
        89258: (e) => {
            e.exports = "حاشیه هدف";
        },
        45302: (e) => {
            e.exports = ["رنگ محدوده سود"];
        },
        74289: (e) => {
            e.exports = "متن هدف";
        },
        17932: (e) => {
            e.exports = ["شکستن خودکار خطوط"];
        },
        55325: (e) => {
            e.exports = "برچسب زمان";
        },
        77838: (e) => {
            e.exports = "سطوح";
        },
        2295: (e) => {
            e.exports = ["شفافیت"];
        },
        4372: (e) => {
            e.exports = "خط روند";
        },
        26775: (e) => {
            e.exports = "باند بالایی #1";
        },
        21774: (e) => {
            e.exports = "باند بالایی #2";
        },
        21076: (e) => {
            e.exports = "باند بالایی #3";
        },
        12374: (e) => {
            e.exports = "استفاده از یک رنگ";
        },
        53473: (e) => {
            e.exports = "میانگین وزنی حجم معاملات";
        },
        91322: (e) => {
            e.exports = "مقادیر";
        },
        25227: (e) => {
            e.exports = "واریانس";
        },
        1670: (e) => {
            e.exports = "تغییر زاویه";
        },
        38829: (e) => {
            e.exports = " تغییر رنگ پیکان";
        },
        23723: (e) => {
            e.exports = "تغییر مختصات X میله";
        },
        72080: (e) => {
            e.exports = "تغییر رنگ پرچم";
        },
        66266: (e) => {
            e.exports = "تغییر مختصات Y قیمت";
        },
        98905: (e) => {
            e.exports = "تغییر حاشیه بالا";
        },
        11049: (e) => {
            e.exports = "تغییر مختصات Y موقعیت عمودی";
        },
        98057: (e) => {
            e.exports = "تغییر رنگ خط VWAP {title}";
        },
        55218: (e) => {
            e.exports = "تغییر عرض خط VWAP {title}";
        },
        31804: (e) => {
            e.exports = " تغییر {title} به پادساعتگرد";
        },
        99128: (e) => {
            e.exports = "تغییر قابل مشاهده بودن ضرایب {title} به عنوان درصد";
        },
        20216: (e) => {
            e.exports = "تغییر رنگ {title}";
        },
        35435: (e) => {
            e.exports = "تغییر حالت آمار فشرده {title}";
        },
        550: (e) => {
            e.exports = "تغییر رنگ حاشیه شمع بالا {title}";
        },
        28146: (e) => {
            e.exports = "تغییر قابل مشاهده بودن حاشیه شمع {title}";
        },
        7373: (e) => {
            e.exports = "تغییر رنگ حاشیه شمع پایین {title}";
        },
        38742: (e) => {
            e.exports = "تغییر رنگ شمع پایین {title}";
        },
        42273: (e) => {
            e.exports = "تغییر رنگ شمع بالا {title}";
        },
        76054: (e) => {
            e.exports = "تغییر رنگ فتیله شمع {title}";
        },
        27029: (e) => {
            e.exports = "تغییر قابل مشاهده بودن فتیله شمع {title}";
        },
        22430: (e) => {
            e.exports = "تغییر قابل مشاهده بودن تغییر در پیپ‌ها {title}";
        },
        45537: (e) => {
            e.exports = "تغییر قابل مشاهده بودن زاویه {title}";
        },
        31775: (e) => {
            e.exports = " تغییر اندازه حساب {title}";
        },
        37913: (e) => {
            e.exports = "تغییر همیشه نمایش دادن آمار {title}";
        },
        15521: (e) => {
            e.exports = "تغییر رنگ تمام خطوط {title}";
        },
        17466: (e) => {
            e.exports = "تغییر رنگ خط قوس‌ها {index} {title}";
        },
        72307: (e) => {
            e.exports = "تغییر عرض خط قوس‌ها {index} {title}";
        },
        13853: (e) => {
            e.exports = "تغییر قابل مشاهده بودن خط قوس‌ها {index} {title}";
        },
        78680: (e) => {
            e.exports = "تغییر مقدار متوسط HL {title}";
        },
        15802: (e) => {
            e.exports = " تغییر قابل مشاهده بودن برچسب‌های پایین {title}";
        },
        36438: (e) => {
            e.exports = "تغییر شفافیت پس‌زمینه {title}";
        },
        64548: (e) => {
            e.exports = "change {title} background visibility";
        },
        75312: (e) => {
            e.exports = "change {title} background color";
        },
        39651: (e) => {
            e.exports = "تغییر رنگ پس‌زمینه 1 {title}";
        },
        78177: (e) => {
            e.exports = "تغییر رنگ پس‌زمینه 2 {title}";
        },
        42746: (e) => {
            e.exports = "تغییر قابل مشاهده بودن دامنه میله‌ها {title}";
        },
        53770: (e) => {
            e.exports = "تغییر قابل مشاهده بودن شبکه {title}";
        },
        29145: (e) => {
            e.exports = "تغییر رنگ خط شبکه {title}";
        },
        64949: (e) => {
            e.exports = "تغییر سبک خط شبکه {title}";
        },
        93548: (e) => {
            e.exports = "تغییر عرض خط شبکه {title}";
        },
        15485: (e) => {
            e.exports = "غییر قابل مشاهده بودن دامنه تاریخ/زمان {title}";
        },
        3400: (e) => {
            e.exports = "change {title} degree";
        },
        91534: (e) => {
            e.exports = "تغییر قابل مشاهده بودن فاصله {title}";
        },
        65056: (e) => {
            e.exports = "تغییر ایموجی {title}";
        },
        65899: (e) => {
            e.exports = "تغییر قابل مشاهده بودن ایموجی {title}";
        },
        59354: (e) => {
            e.exports = "تغییر قیمت ورود {title}";
        },
        1447: (e) => {
            e.exports = " تغییر امتداد پایین {title}";
        },
        15258: (e) => {
            e.exports = "تغییر امتداد چپ {title}";
        },
        96902: (e) => {
            e.exports = "تغییر امتداد خطوط {title}";
        },
        896: (e) => {
            e.exports = "تغییر امتداد بالا {title}";
        },
        3708: (e) => {
            e.exports = "تغییر در حال امتداد به چپ {title}";
        },
        52889: (e) => {
            e.exports = "تغییر در حال امتداد به راست {title}";
        },
        86647: (e) => {
            e.exports = " تغییر بسط {title}";
        },
        3156: (e) => {
            e.exports = "تغییر رنگ متن خطا {title}";
        },
        49885: (e) => {
            e.exports = "تغییر رنگ پس‌زمینه خطا {title}";
        },
        89126: (e) => {
            e.exports = "change {title} fan {index} line visibility";
        },
        30016: (e) => {
            e.exports = "change {title} fan {index} line width";
        },
        82516: (e) => {
            e.exports = "change {title} fan {index} line color";
        },
        78142: (e) => {
            e.exports = "change {title} fans visibility";
        },
        79467: (e) => {
            e.exports = "change {title} fans line color";
        },
        45739: (e) => {
            e.exports = "change {title} fib levels based on log scale";
        },
        99670: (e) => {
            e.exports = "تغییر معکوس {title}";
        },
        35165: (e) => {
            e.exports = "تغییر قابل مشاهده بودن دایره‌های کامل {title}";
        },
        48983: (e) => {
            e.exports = "تغییر رنگ پس‌زمینه تصویر {title}";
        },
        45025: (e) => {
            e.exports = "تغییر اندازه لات {title}";
        },
        13901: (e) => {
            e.exports = "تغییر رنگ خط باند پایینی #1 {title}";
        },
        78425: (e) => {
            e.exports = "تغییر قابل مشاهده بودن خط باند پایینی #1 {title}";
        },
        99491: (e) => {
            e.exports = "تغییر عرض خط باند پایینی #1 {title}";
        },
        55469: (e) => {
            e.exports = "cتغییر رنگ خط باند پایینی #2 {title}";
        },
        76157: (e) => {
            e.exports = "تغییر قابل مشاهده بودن خط باند پایینی #2 {title}";
        },
        8081: (e) => {
            e.exports = "تغییر عرض خط باند پایینی #2 {title}";
        },
        95016: (e) => {
            e.exports = "تغییر رنگ خط باند پایینی #3 {title}";
        },
        84928: (e) => {
            e.exports = "تغییر قابل مشاهده بودن خط باند پایینی #3 {title}";
        },
        44693: (e) => {
            e.exports = "تغییر عرض خط باند پایینی #3 {title}";
        },
        81170: (e) => {
            e.exports = "تغییر تراز برچسب‌ها {title}";
        },
        22775: (e) => {
            e.exports = "تغییر اندازه قلم برچسب‌ها {title}";
        },
        24338: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب‌ها {title}";
        },
        32891: (e) => {
            e.exports = "تغییر ضریب خط سطح {index} {title}";
        },
        85551: (e) => {
            e.exports = "تغییر رنگ خط سطح {index} {title}";
        },
        47840: (e) => {
            e.exports = "تغییر سبک خط سطح {index} {title}";
        },
        45463: (e) => {
            e.exports = "تغییر قابل مشاهده بودن خط سطح {index} {title}";
        },
        90098: (e) => {
            e.exports = "تغییر عرض خط سطح {index} {title}";
        },
        26710: (e) => {
            e.exports = "تغییر قابل مشاهده بودن سطوح {title}";
        },
        2359: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب‌های چپ {title}";
        },
        44643: (e) => {
            e.exports = "تغییر عرض خط {title}";
        },
        20563: (e) => {
            e.exports = "تغییر رنگ خط {title}";
        },
        66982: (e) => {
            e.exports = "تغییر سبک خط {title}";
        },
        94441: (e) => {
            e.exports = "تغییر حالت {title}";
        },
        89996: (e) => {
            e.exports = "تغییر قابل مشاهده بودن نقطه میانی {title}";
        },
        36618: (e) => {
            e.exports = "تغییر معکوس {title}";
        },
        18544: (e) => {
            e.exports = "تغییر رنگ پس‌زمینه منبع {title}";
        },
        48035: (e) => {
            e.exports = "تغییر رنگ حاشیه منبع {title}";
        },
        42286: (e) => {
            e.exports = "تغییر رنگ متن منبع {title}";
        },
        588: (e) => {
            e.exports = "تغییر موقعیت آمار {title}";
        },
        54659: (e) => {
            e.exports = "تغییر رنگ توقف {title}";
        },
        89182: (e) => {
            e.exports = "تغییر سطح توقف {title}";
        },
        82224: (e) => {
            e.exports = "تغییر قیمت توقف {title}";
        },
        88383: (e) => {
            e.exports = "تغییر رنگ متن موفقیت {title}";
        },
        26967: (e) => {
            e.exports = "تغییر رنگ پس‌زمینه موفقیت {title}";
        },
        62243: (e) => {
            e.exports = "تغییر قابل مشاهده بودن تغییر درصدی {title}";
        },
        45936: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب قیمت {title}";
        },
        88577: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب‌های قیمت {title}";
        },
        47045: (e) => {
            e.exports = "تغییر قابل مشاهده بودن محدوده قیمت {title}";
        },
        94028: (e) => {
            e.exports = "تغییر قابل مشاهده بودن قیمت {title}";
        },
        56175: (e) => {
            e.exports = "تغییر قابل مشاهده بودن قیمت‌ها {title}";
        },
        44539: (e) => {
            e.exports = "تغییر سطح سود {title}";
        },
        41646: (e) => {
            e.exports = "تغییر قیمت سود {title}";
        },
        52877: (e) => {
            e.exports = "تغییر معکوس {title}";
        },
        16598: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب‌های راست {title}";
        },
        31553: (e) => {
            e.exports = "تغییر ریسک {title}";
        },
        40344: (e) => {
            e.exports = "تغییر حالت نمایش ریسک {title}";
        },
        73137: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب‌های بالا {title}";
        },
        52387: (e) => {
            e.exports = "تغییر رنگ پس‌زمینه هدف {title}";
        },
        6921: (e) => {
            e.exports = "تغییر رنگ حاشیه هدف {title}";
        },
        97573: (e) => {
            e.exports = "تغییر رنگ هدف {title}";
        },
        27634: (e) => {
            e.exports = "تغییر رنگ متن هدف {title}";
        },
        33822: (e) => {
            e.exports = "تغییر قابل مشاهده بودن برچسب زمان {title}";
        },
        84321: (e) => {
            e.exports = "تغییر شفافیت {title}";
        },
        10417: (e) => {
            e.exports = "تغییر رنگ خط باند بالایی #1 {title}";
        },
        58722: (e) => {
            e.exports = "تغییر قابل مشاهده بودن خط باند بالایی #1 {title}";
        },
        13633: (e) => {
            e.exports = "تغییر عرض خط باند بالایی #1 {title}";
        },
        64709: (e) => {
            e.exports = "تغییر رنگ خط باند بالایی #2 {title}";
        },
        97847: (e) => {
            e.exports = "تغییر قابل مشاهده بودن خط باند بالایی #2 {title}";
        },
        62921: (e) => {
            e.exports = "تغییر عرض خط باند بالایی #2 {title}";
        },
        94153: (e) => {
            e.exports = "تغییر رنگ خط باند بالایی #3 {title}";
        },
        19835: (e) => {
            e.exports = "تغییر قابل مشاهده بودن خط باند بالایی #3 {title}";
        },
        68310: (e) => {
            e.exports = "تغییر عرض خط باند بالایی #3 {title}";
        },
        12355: (e) => {
            e.exports = "تغییر مقدار واریانس {title}";
        },
        25937: (e) => {
            e.exports = "تغییر تراز عمودی برچسب‌های {toolName}";
        },
        46991: (e) => {
            e.exports = "تغییر تراز افقی برچسب‌های {toolName}";
        },
        73080: (e) => {
            e.exports = "تغییر جهت برچسب‌های {toolName}";
        },
        24272: (e) => {
            e.exports = "تغییر قابل مشاهده بودن خط {toolName}";
        },
        46404: (e) => {
            e.exports = "تغییر عرض خط {toolName}";
        },
        50265: (e) => {
            e.exports = "تغییر رنگ خط {toolName}";
        },
        72781: (e) => {
            e.exports = "تغییر خط {toolName} در حال امتداد به چپ";
        },
        84613: (e) => {
            e.exports = "تغییر خط {toolName} در حال امتداد به راست";
        },
        62603: (e) => {
            e.exports = "تغییر انتهای چپ خط {toolName}";
        },
        62412: (e) => {
            e.exports = "تغییر انتهای راست خط {toolName}";
        },
        35422: (e) => {
            e.exports = "تغییر سبک خط {toolName}";
        },
        77690: (e) => {
            e.exports = "تغییر متن {toolName}";
        },
        69871: (e) => {
            e.exports = "تغییر قابل مشاهده بودن متن {toolName}";
        },
        25878: (e) => {
            e.exports = "تغییر پوشش متن {toolName}";
        },
        91832: (e) => {
            e.exports = "تغییر رنگ پس‌زمینه متن {toolName}";
        },
        18610: (e) => {
            e.exports = "تغییر قابل مشاهده بودن پس‌زمینه متن {toolName}";
        },
        44755: (e) => {
            e.exports = "تغییر رنگ حاشیه متن {toolName}";
        },
        6324: (e) => {
            e.exports = "تغییر عرض حاشیه متن {toolName}";
        },
        45529: (e) => {
            e.exports = "تغییر قابل مشاهده بودن حاشیه متن {toolName}";
        },
        6500: (e) => {
            e.exports = "تغییر رنگ متن {toolName}";
        },
        51614: (e) => {
            e.exports = "تغییر فونت متن {toolName} به بولد";
        },
        18572: (e) => {
            e.exports = "تغییر فونت متن {toolName} به ایتالیک";
        },
        48382: (e) => {
            e.exports = "تغییر اندازه فونت متن {toolName}";
        },
        18567: (e) => {
            e.exports = "تغییر ویژگی {propertyName}";
        },
        21926: (e) => {
            e.exports = "رنگ پس‌زمینه‌ها";
        },
        52241: (e) => {
            e.exports = "پر شدن پس‌زمینه‌ها";
        },
        70607: (e) => {
            e.exports = "رنگ خطوط";
        },
        41075: (e) => {
            e.exports = "سبک خطوط";
        },
        73043: (e) => {
            e.exports = "عرض خطوط";
        },
        72223: (e) => {
            e.exports = "جابجایی نقشه‌ها";
        },
        93046: (e) => {
            e.exports = "نمایش قیمت";
        },
        41437: (e) => {
            e.exports = ["رنگ متن"];
        },
    },
]);
