(self.webpackChunktradingview = self.webpackChunktradingview || []).push([
    [5362],
    {
        40276: (e) => {
            e.exports = "افزودن";
        },
        53585: (e) => {
            e.exports = ["افزودن رنگ سفارشی"];
        },
        81865: (e) => {
            e.exports = "کدورت";
        },
        19801: (e) => {
            e.exports = "Fr";
        },
        11268: (e) => {
            e.exports = "Mo";
        },
        63331: (e) => {
            e.exports = "Sa";
        },
        85954: (e) => {
            e.exports = "Su";
        },
        26230: (e) => {
            e.exports = "We";
        },
        24793: (e) => {
            e.exports = "Th";
        },
        31533: (e) => {
            e.exports = "Tu";
        },
        73755: (e) => {
            e.exports = "نماد دیگر";
        },
        16936: (e) => {
            e.exports = "بازگشت";
        },
        88046: (e) => {
            e.exports = "نماد اصلی نمودار";
        },
        9898: (e) => {
            e.exports = "راست";
        },
        52051: (e) => {
            e.exports = "تقویم در حال حاضر در سال {year} است";
        },
        99990: (e) => {
            e.exports = "تقویم در حال حاضر از سال {year_start} تا {year_end} است";
        },
        92702: (e) => {
            e.exports = "تقویم در حال حاضر در {month} است";
        },
        20036: (e) => {
            e.exports = ["لغو"];
        },
        23398: (e) => {
            e.exports = ["تغییر نماد"];
        },
        94551: (e) => {
            e.exports = ["نمودار"];
        },
        80395: (e) => {
            e.exports = "بستن منو";
        },
        64498: (e) => {
            e.exports = "همه منابع";
        },
        97637: (e) => {
            e.exports = ["فروردین"];
        },
        86797: (e) => {
            e.exports = ["مرداد"];
        },
        79852: (e) => {
            e.exports = "اوراق قرضه";
        },
        55669: (e) => {
            e.exports = ["آذر"];
        },
        56095: (e) => {
            e.exports = "کاهش";
        },
        29601: (e) => {
            e.exports = ["شرح"];
        },
        16467: (e) => {
            e.exports = "بهمن";
        },
        72970: (e) => {
            e.exports = "جمعه";
        },
        46812: (e) => {
            e.exports = "افزایش";
        },
        26910: (e) => {
            e.exports = "ژانویه";
        },
        23230: (e) => {
            e.exports = "جولای";
        },
        49385: (e) => {
            e.exports = "خرداد";
        },
        90784: (e) => {
            e.exports = "دی";
        },
        89298: (e) => {
            e.exports = ["فاصله"];
        },
        68988: (e) => {
            e.exports = "باشه";
        },
        61199: (e) => {
            e.exports = "دوشنبه";
        },
        95543: (e) => {
            e.exports = "ماه‌ها";
        },
        68327: (e) => {
            e.exports = ["اردیبهشت"];
        },
        84675: (e) => {
            e.exports = "اسفند";
        },
        29673: (e) => {
            e.exports = "هیچ بورسی با معیارهای شما مطابقت ندارد";
        },
        41379: (e) => {
            e.exports = "هیچ نمادی با معیارهای شما مطابقت ندارد";
        },
        71194: (e) => {
            e.exports = "آبان";
        },
        83771: (e) => {
            e.exports = "سال بعد";
        },
        75385: (e) => {
            e.exports = "سال‌های بعد";
        },
        39752: (e) => {
            e.exports = "ماه بعد";
        },
        35563: (e) => {
            e.exports = "قالب عدد نامعتبر است.";
        },
        19724: (e) => {
            e.exports = "منابع";
        },
        1144: (e) => {
            e.exports = "شنبه";
        },
        52298: (e) => {
            e.exports = ["جستجو"];
        },
        13269: (e) => {
            e.exports = "انتخاب منبع";
        },
        61132: (e) => {
            e.exports = "شهریور";
        },
        2607: (e) => {
            e.exports = "مقدار مشخص شده بیشتر از حداکثر ابزار {max} است.";
        },
        53669: (e) => {
            e.exports = "مقدار مشخص شده کمتر از حداقل ابزار {min} است.";
        },
        72149: (e) => {
            e.exports = "یکشنبه";
        },
        83583: (e) => {
            e.exports = "تغییر به ماه‌ها";
        },
        6244: (e) => {
            e.exports = "تغییر به تاریخ‌ها";
        },
        80879: (e) => {
            e.exports = "تغییر به سال‌ها";
        },
        89053: (e) => {
            e.exports = ["نماد"];
        },
        48490: (e) => {
            e.exports = "نماد و توضیحات";
        },
        99983: (e) => {
            e.exports = "جستجوی نماد";
        },
        32457: (e) => {
            e.exports = "لطفا تاریخ صحیح را وارد کنید";
        },
        5122: (e) => {
            e.exports = "لطفا قالب تاریخ صحیح yyyy-mm-dd را وارد کنید";
        },
        2587: (e) => {
            e.exports = "ماه قبل";
        },
        39329: (e) => {
            e.exports = "سال قبل";
        },
        27004: (e) => {
            e.exports = "سال‌های قبل";
        },
        54336: (e) => {
            e.exports = "حذف رنگ";
        },
        7147: (e) => {
            e.exports = "چهارشنبه";
        },
        7951: (e) => {
            e.exports = "پنجشنبه";
        },
        60142: (e) => {
            e.exports = "ضخامت";
        },
        44979: (e) => {
            e.exports = "سه‌شنبه";
        },
        69325: (e) => {
            e.exports = "سال‌ها";
        },
        12629: (e) => {
            e.exports = "کالا";
        },
        87592: (e) => {
            e.exports = "cfd";
        },
        17023: (e) => {
            e.exports = "تغییر کدورت";
        },
        13066: (e) => {
            e.exports = "تغییر رنگ";
        },
        95657: (e) => {
            e.exports = "تغییر ضخامت";
        },
        18567: (e) => {
            e.exports = "تغییر ویژگی {propertyName}";
        },
        36962: (e) => {
            e.exports = "بستن";
        },
        8448: (e) => {
            e.exports = "ارز دیجیتال";
        },
        67245: (e) => {
            e.exports = "dr";
        },
        88720: (e) => {
            e.exports = "اقتصاد";
        },
        39512: (e) => {
            e.exports = "فارکس";
        },
        81859: (e) => {
            e.exports = "آتی";
        },
        39337: (e) => {
            e.exports = "بالا";
        },
        91815: (e) => {
            e.exports = "hl2";
        },
        40771: (e) => {
            e.exports = "hlc3";
        },
        9523: (e) => {
            e.exports = "hlcc4";
        },
        12754: (e) => {
            e.exports = "شاخص";
        },
        60804: (e) => {
            e.exports = "شاخص‌ها";
        },
        12504: (e) => {
            e.exports = "ohlc4";
        },
        38466: (e) => {
            e.exports = "باز";
        },
        3919: (e) => {
            e.exports = "پایین";
        },
        36931: (e) => {
            e.exports = "سهام";
        }
        
    },
]);
