(self.webpackChunktradingview = self.webpackChunktradingview || []).push([
    [6306],
    {
        74274: (e) => {
            e.exports = ["به‌علاوه"];
        },
        60558: (e) => {
            e.exports = "حیوانات و طبیعت";
        },
        14232: (e) => {
            e.exports = "فعالیت";
        },
        35305: (e) => {
            e.exports = "خوراکی و نوشیدنی";
        },
        49546: (e) => {
            e.exports = "پرچم‌ها";
        },
        72302: (e) => {
            e.exports = "اشیاء";
        },
        96330: (e) => {
            e.exports = "لبخندها و مردم";
        },
        6878: (e) => {
            e.exports = "نمادها";
        },
        15426: (e) => {
            e.exports = "اخیراً استفاده شده";
        },
        15395: (e) => {
            e.exports = "سفر و مکان‌ها";
        },
        41596: (e) => {
            e.exports = "برچسب‌ها بر روی مقیاس قیمت";
        },
        45811: (e) => {
            e.exports = "مقادیر در خط وضعیت";
        },
        39495: (e) => {
            e.exports = ["دایره"];
        },
        41389: (e) => {
            e.exports = ["نمودار بالا"];
        },
        29520: (e) => {
            e.exports = "مطلق";
        },
        67049: (e) => {
            e.exports = "اعمال تنظیمات پیش‌فرض";
        },
        65262: (e) => {
            e.exports = ["ناحیه"];
        },
        83760: (e) => {
            e.exports = "بدن";
        },
        48848: (e) => {
            e.exports = ["حاشیه"];
        },
        27331: (e) => {
            e.exports = ["پس‌زمینه"];
        },
        78626: (e) => {
            e.exports = ["زیر نمودار"];
        },
        16079: (e) => {
            e.exports = "تدریجی";
        },
        42973: (e) => {
            e.exports = "خط نقطه‌چین";
        },
        41361: (e) => {
            e.exports = "پایین";
        },
        59317: (e) => {
            e.exports = "خط چین‌دار";
        },
        31577: (e) => {
            e.exports = "در حال توسعه VA";
        },
        4329: (e) => {
            e.exports = ["پیش‌فرض"];
        },
        98938: (e) => {
            e.exports = ["پیش‌فرض‌ها"];
        },
        45044: (e) => {
            e.exports = "مخفی";
        },
        11091: (e) => {
            e.exports = ["میله‌ای"];
        },
        40297: (e) => {
            e.exports = "خروجی‌ها";
        },
        36993: (e) => {
            e.exports = ["حداقل مقیاس قیمت"];
        },
        64606: (e) => {
            e.exports = "فونت برچسب‌ها";
        },
        54934: (e) => {
            e.exports = "خط با وقفه‌ها";
        },
        41610: (e) => {
            e.exports = ["بیشتر"];
        },
        55362: (e) => {
            e.exports = ["خط"];
        },
        35637: (e) => {
            e.exports = "جامد";
        },
        18229: (e) => {
            e.exports = ["ذخیره به عنوان پیش‌فرض"];
        },
        86520: (e) => {
            e.exports = ["برچسب‌های سیگنال"];
        },
        64108: (e) => {
            e.exports = "خط پله‌ای با وقفه‌ها";
        },
        67767: (e) => {
            e.exports = "خط پله‌ای با الماس‌ها";
        },
        91502: (e) => {
            e.exports = "قرارگیری";
        },
        73947: (e) => {
            e.exports = ["دقت"];
        },
        66596: (e) => {
            e.exports = "مقدار";
        },
        79782: (e) => {
            e.exports = "تنظیمات مجدد";
        },
        95247: (e) => {
            e.exports = ["عرض (% از جعبه)"];
        },
        19221: (e) => {
            e.exports = ["رنگ متن"];
        },
        77409: (e) => {
            e.exports = ["معاملات بر روی نمودار"];
        },
        98802: (e) => {
            e.exports = "بالا";
        },
        78019: (e) => {
            e.exports = "استفاده از نشانه‌های ریاضی خاص برای جابجایی نقاشی‌های انتخاب شده: +,-,/,* برای قیمت و +,- برای شاخص نوار.";
        },
        14414: (e) => {
            e.exports = ["حجم پروفایل"];
        },
        91322: (e) => {
            e.exports = "مقادیر";
        },
        20834: (e) => {
            e.exports = "تغییر حداقل تیک";
        },
        98491: (e) => {
            e.exports = "تغییر کاراکتر";
        },
        7378: (e) => {
            e.exports = "تغییر اندازه فونت";
        },
        28691: (e) => {
            e.exports = "تغییر سبک خط";
        },
        38361: (e) => {
            e.exports = "تغییر مکان";
        },
        51081: (e) => {
            e.exports = "تغییر عرض درصدی";
        },
        47634: (e) => {
            e.exports = "تغییر مکان‌گذاری";
        },
        15683: (e) => {
            e.exports = "تغییر نوع نمودار";
        },
        164: (e) => {
            e.exports = "تغییر دقت";
        },
        86888: (e) => {
            e.exports = "تغییر شکل";
        },
        50463: (e) => {
            e.exports = "تغییر مقدار";
        },
        12628: (e) => {
            e.exports = "تغییر دید مقادیر";
        },
        76080: (e) => {
            e.exports = "e.g. +1";
        },
        95166: (e) => {
            e.exports = "e.g. /2";
        },
    },
]);
