(self.webpackChunktradingview = self.webpackChunktradingview || []).push([
    [9417],
    {
        40276: (e) => {
            e.exports = "Add";
        },
        53585: (e) => {
            e.exports = ["افزودن رنگ سفارشی"];
        },
        81865: (e) => {
            e.exports = "شفافیت";
        },
        2443: (e) => {
            e.exports = "سبک خط ابزار(ها)";
        },
        40054: (e) => {
            e.exports = ["رنگ"];
        },
        44629: (e) => {
            e.exports = ["افزودن به موارد مورد علاقه"];
        },
        38455: (e) => {
            e.exports = ["رنگ پس‌زمینه"];
        },
        79964: (e) => {
            e.exports = ["رنگ پس‌زمینه ۱"];
        },
        45320: (e) => {
            e.exports = ["رنگ پس‌زمینه ۲"];
        },
        60925: (e) => {
            e.exports = ["نقطه"];
        },
        42973: (e) => {
            e.exports = "خط نقطه‌چین";
        },
        59317: (e) => {
            e.exports = "خط چین‌دار";
        },
        99289: (e) => {
            e.exports = ["پاک‌کن"];
        },
        23886: (e) => {
            e.exports = ["اندازه قلم"];
        },
        17006: (e) => {
            e.exports = ["اندازه قلم"];
        },
        17517: (e) => {
            e.exports = ["عدم نمایش اشکال"];
        },
        74813: (e) => {
            e.exports = "مخفی کردن نوار ابزار نقاشی‌های مورد علاقه";
        },
        37057: (e) => {
            e.exports = ["قفل کردن ابزار های رسم"];
        },
        71845: (e) => {
            e.exports = "پس‌زمینه ابزار خط";
        },
        12928: (e) => {
            e.exports = "رنگ‌های ابزار خط";
        },
        21327: (e) => {
            e.exports = "رنگ‌های متن ابزار خط";
        },
        86327: (e) => {
            e.exports = "عرض ابزار خط";
        },
        47059: (e) => {
            e.exports = "عرض‌های ابزار خط";
        },
        41610: (e) => {
            e.exports = ["بیشتر"];
        },
        79165: (e) => {
            e.exports = "جادو";
        },
        37140: (e) => {
            e.exports = "حالت مغناطیس نقاشی‌های قرار گرفته در نزدیکی نوارهای قیمت را به نزدیک‌ترین مقدار OHLC می‌چسباند";
        },
        67455: (e) => {
            e.exports = ["رنگ نشانگر"];
        },
        59607: (e) => {
            e.exports = "اندازه‌گیری";
        },
        36551: (e) => {
            e.exports = "نقاشی‌های جدید به همه نمودارهای طرح‌بندی تکرار شده و هنگامی که همان نماد انتخاب شود نمایش داده می‌شوند";
        },
        91977: (e) => {
            e.exports = "نمایش ابزارهای مخفی";
        },
        51072: (e) => {
            e.exports = "نمایش درخت شیء";
        },
        49421: (e) => {
            e.exports = ["ماندن در حالت ترسیم"];
        },
        49593: (e) => {
            e.exports = ["رنگ پس‌زمینه توقف"];
        },
        36785: (e) => {
            e.exports = ["رنگ پس‌زمینه سود"];
        },
        76091: (e) => {
            e.exports = "حذف نقاشی‌ها";
        },
        54336: (e) => {
            e.exports = "حذف رنگ";
        },
        72482: (e) => {
            e.exports = ["حذف از موارد مورد علاقه"];
        },
        19221: (e) => {
            e.exports = ["رنگ متن"];
        },
        38925: (e) => {
            e.exports = ["بزرگ نمایی"];
        },
        49895: (e) => {
            e.exports = ["کوچک نمایی"];
        },
        16631: (e) => {
            e.exports = "تغییر رنگ متن ابزار(های) خط";
        },
        74350: (e) => {
            e.exports = "تغییر رنگ پس‌زمینه ابزار(های) خط";
        },
        68519: (e) => {
            e.exports = "تغییر رنگ ابزار(های) خط";
        },
        36819: (e) => {
            e.exports = "تغییر اندازه فونت ابزار(های) خط";
        },
        54769: (e) => {
            e.exports = "تغییر سبک خط ابزار(های) خط";
        },
        41648: (e) => {
            e.exports = "تغییر عرض خط ابزار(های) خط";
        },
        18567: (e) => {
            e.exports = "تغییر ویژگی {propertyName}";
        },
        32868: (e) => {
            e.exports = "{hotKey_0} + کلیک بر روی نمودار";
        },
        68125: (e) => {
            e.exports = "{hotKey_0} — دایره";
        },
        40234: (e) => {
            e.exports = "{hotKey_0} — رسم یک خط مستقیم در زوایای 45";
        },
        10289: (e) => {
            e.exports = "{hotKey_0} — افزایش‌های ثابت";
        },
        81591: (e) => {
            e.exports = "{hotKey_0} — مربع";
        }
        
    },
]);
